{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "DEBUG:root:parsed has: set()\n",
      "DEBUG:root:unparsed has: {'http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/dict#', 'file:///global/homes/s/sleak/Monitoring/Resilience/LogSet/examples/cray-dict.ttl', 'http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#', 'file:///global/homes/s/sleak/Monitoring/Resilience/LogSet/examples/nersc.ttl'}\n",
      "DEBUG:root:looking for http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/dict.ttl\n",
      "DEBUG:root:namespaces are now: [('xml', rdflib.term.URIRef('http://www.w3.org/XML/1998/namespace')), ('rdf', rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#')), ('rdfs', rdflib.term.URIRef('http://www.w3.org/2000/01/rdf-schema#')), ('xsd', rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#')), ('owl', rdflib.term.URIRef('http://www.w3.org/2002/07/owl#')), ('dcat', rdflib.term.URIRef('http://www.w3.org/ns/dcat#')), ('logset', rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#')), ('', rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/dict#'))]\n",
      "DEBUG:root:looking for file:///global/homes/s/sleak/Monitoring/Resilience/LogSet/examples/cray-dict.ttl\n",
      "DEBUG:root:namespaces are now: [('xml', rdflib.term.URIRef('http://www.w3.org/XML/1998/namespace')), ('rdf', rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#')), ('rdfs', rdflib.term.URIRef('http://www.w3.org/2000/01/rdf-schema#')), ('xsd', rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#')), ('owl', rdflib.term.URIRef('http://www.w3.org/2002/07/owl#')), ('dcat', rdflib.term.URIRef('http://www.w3.org/ns/dcat#')), ('logset', rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#')), ('', rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/dict#')), ('dict', rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/dict#')), ('default1', rdflib.term.URIRef('file:///global/homes/s/sleak/Monitoring/Resilience/LogSet/examples/cray-dict#'))]\n",
      "DEBUG:root:looking for http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset.ttl\n",
      "DEBUG:root:namespaces are now: [('xml', rdflib.term.URIRef('http://www.w3.org/XML/1998/namespace')), ('rdf', rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#')), ('rdfs', rdflib.term.URIRef('http://www.w3.org/2000/01/rdf-schema#')), ('xsd', rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#')), ('owl', rdflib.term.URIRef('http://www.w3.org/2002/07/owl#')), ('dcat', rdflib.term.URIRef('http://www.w3.org/ns/dcat#')), ('logset', rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#')), ('', rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/dict#')), ('dict', rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/dict#')), ('default1', rdflib.term.URIRef('file:///global/homes/s/sleak/Monitoring/Resilience/LogSet/examples/cray-dict#')), ('dct', rdflib.term.URIRef('http://purl.org/dc/terms/')), ('foaf', rdflib.term.URIRef('http://xmlns.com/foaf/0.1/')), ('adms', rdflib.term.URIRef('http://www.w3.org/ns/adms#')), ('default2', rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#'))]\n",
      "DEBUG:root:looking for file:///global/homes/s/sleak/Monitoring/Resilience/LogSet/examples/nersc.ttl\n",
      "DEBUG:root:namespaces are now: [('xml', rdflib.term.URIRef('http://www.w3.org/XML/1998/namespace')), ('rdf', rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#')), ('rdfs', rdflib.term.URIRef('http://www.w3.org/2000/01/rdf-schema#')), ('xsd', rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#')), ('owl', rdflib.term.URIRef('http://www.w3.org/2002/07/owl#')), ('dcat', rdflib.term.URIRef('http://www.w3.org/ns/dcat#')), ('logset', rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#')), ('', rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/dict#')), ('dict', rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/dict#')), ('default1', rdflib.term.URIRef('file:///global/homes/s/sleak/Monitoring/Resilience/LogSet/examples/cray-dict#')), ('dct', rdflib.term.URIRef('http://purl.org/dc/terms/')), ('foaf', rdflib.term.URIRef('http://xmlns.com/foaf/0.1/')), ('adms', rdflib.term.URIRef('http://www.w3.org/ns/adms#')), ('default2', rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#')), ('default3', rdflib.term.URIRef('file:///global/homes/s/sleak/Monitoring/Resilience/LogSet/examples/nersc#'))]\n",
      "DEBUG:root:parsed has: {'http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/dict#', 'file:///global/homes/s/sleak/Monitoring/Resilience/LogSet/examples/cray-dict.ttl', 'http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#', 'file:///global/homes/s/sleak/Monitoring/Resilience/LogSet/examples/nersc.ttl'}\n",
      "DEBUG:root:unparsed has: set()\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "/global/u1/s/sleak/Monitoring/Resilience/LogSet/examples\n",
      "sys.version_info(major=3, minor=6, micro=3, releaselevel='final', serial=0)\n",
      "hello\n",
      "\n",
      "Catalogs:\n",
      "\n",
      "LogSets:\n"
     ]
    }
   ],
   "source": [
    "import sys\n",
    "sys.path.append('/global/homes/s/sleak/.local/cori/3.6-anaconda-4.4/lib/python3.6/site-packages')\n",
    "import rdflib\n",
    "\n",
    "import logging\n",
    "logger = logging.getLogger()\n",
    "logger.setLevel(logging.DEBUG)\n",
    "\n",
    "import os\n",
    "print(os.getcwd())\n",
    "\n",
    "sys.path.append('/global/homes/s/sleak/Monitoring/Resilience/LogSet/src')\n",
    "import LogsGraph    \n",
    "\n",
    "# force re-read of LogsGraph.py in case I've edited it:\n",
    "import importlib\n",
    "importlib.reload(LogsGraph)\n",
    "\n",
    "def dump(graph):\n",
    "    #for s,o,p in graph:\n",
    "    #    print ('{0} --- {1} --- {2}'.format(s,o,p))\n",
    "    print(graph.serialize(format='n3').decode('ascii'))\n",
    "\n",
    "import urllib.request\n",
    "def parse_line_by_line(url, fmt):\n",
    "    \"\"\" rdflib is really uninformative about the location of the error\n",
    "        when it can't parse a file, so use this to parse line-by-line \n",
    "        and look for errors\n",
    "        (hmm, does not work, fails on valid files)\n",
    "    \"\"\"\n",
    "    f = urllib.request.urlopen(url)\n",
    "    g = rdflib.ConjunctiveGraph()\n",
    "    linecount=0\n",
    "    for line in f.readlines():\n",
    "        linecount += 1\n",
    "        print(\"parsing line {0:d}: {1}\".format(linecount,line))\n",
    "        rdftext = line.strip()\n",
    "        if not rdftext: continue\n",
    "        try:\n",
    "            g.parse(data=rdftext, format=fmt)\n",
    "        except:\n",
    "            print(\"failed to parse line {0:d} of {1}\".format(linecount,url))\n",
    "            print(line)\n",
    "            print(g.serialize())\n",
    "            raise\n",
    "    print(\"finished parsing {0:s} successfully!\".format(url))\n",
    "    \n",
    "\n",
    "# quick sanity check:\n",
    "#parse_line_by_line('file:/global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/nersc-entities.ttl', 'turtle')\n",
    "#g1 = rdflib.ConjunctiveGraph().parse(\"file:/global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index.ttl\", format='turtle')\n",
    "#print(\"got this far...\")\n",
    "#print(g1.serialize(format='n3').decode('ascii'))\n",
    "\n",
    "print(\"hello\")\n",
    "\n",
    "#graph = LogsGraph.construct('nersc-catalog.ttl', spider=True)\n",
    "f1='file:///global/homes/s/sleak/Monitoring/Resilience/LogSet/examples/nersc.ttl'\n",
    "f2='file:///global/homes/s/sleak/Monitoring/Resilience/LogSet/examples/cray-dict.ttl'\n",
    "graph = LogsGraph.construct(f1,f2,spider=True)\n",
    "\n",
    "query = '''select ?id ?title where { ?id a dcat:Catalog .\n",
    "                                     ?id dct:title ?title . }'''\n",
    "print(\"\\nCatalogs:\")\n",
    "for row in graph.query(query):\n",
    "    print('{0}: {1}'.format(str(row[0]),str(row[1])))\n",
    "\n",
    "query = '''select ?id ?desc where { ?id a logset:LogSet .\n",
    "                                     ?id dct:description ?desc . }'''\n",
    "print(\"\\nLogSets:\")\n",
    "for row in graph.query(query):\n",
    "    print('{0}: {1}'.format(str(row[0]),str(row[1])))\n",
    "\n",
    "    \n",
    "#query = 'select ?id ?val WHERE { ?id a ?val . }'\n",
    "#for row in graph.query(query):\n",
    "#    print('{0} --- {1}'.format(str(row[0]),str(row[1])))\n",
    "#    #print(row)\n",
    "#\n",
    "#\n",
    "#query = '''SELECT ?id ?what ?path\n",
    "#WHERE {\n",
    "#?id a logset:ConcreteLog . \n",
    "#?id dcat:downloadURL ?path .\n",
    "#?id logset:isInstanceOf ?what .\n",
    "#} '''\n",
    "#\n",
    "#print(\"concretelogs:\")\n",
    "#for row in graph.query(query):\n",
    "#    print(row)\n",
    "#\n",
    "#query = '''SELECT ?id ?path\n",
    "#WHERE {\n",
    "#?id a logset:ConcreteLog .\n",
    "#?id logset:isInstanceOf dict:console_logfile . \n",
    "#?id dcat:downloadURL ?path .\n",
    "#} '''\n",
    "#print(\"console logfiles:\")\n",
    "#for row in graph.query(query):\n",
    "#    print('{0} --- {1}'.format(str(row[0]),str(row[1]))) \n",
    "#dump(graph)\n",
    "# why am I not finding the console-log that is in the snl index?\n",
    "# ah, typo in index.ttl, point dict prefix at vocab instead .. fixed now\n",
    "# first incarnation will prob be rather fragile...\n",
    "                \n",
    "    \n",
    "\n",
    "#[ns for ns in graph.namespaces()]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[('xml', rdflib.term.URIRef('http://www.w3.org/XML/1998/namespace')),\n",
       " ('rdf', rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#')),\n",
       " ('rdfs', rdflib.term.URIRef('http://www.w3.org/2000/01/rdf-schema#')),\n",
       " ('xsd', rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#')),\n",
       " ('owl', rdflib.term.URIRef('http://www.w3.org/2002/07/owl#')),\n",
       " ('dcat', rdflib.term.URIRef('http://www.w3.org/ns/dcat#')),\n",
       " ('logset',\n",
       "  rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#')),\n",
       " ('',\n",
       "  rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/dict#')),\n",
       " ('dict',\n",
       "  rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/dict#')),\n",
       " ('default1',\n",
       "  rdflib.term.URIRef('file:///global/homes/s/sleak/Monitoring/Resilience/LogSet/examples/cray-dict#')),\n",
       " ('dct', rdflib.term.URIRef('http://purl.org/dc/terms/')),\n",
       " ('foaf', rdflib.term.URIRef('http://xmlns.com/foaf/0.1/')),\n",
       " ('adms', rdflib.term.URIRef('http://www.w3.org/ns/adms#')),\n",
       " ('default2',\n",
       "  rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#')),\n",
       " ('default3',\n",
       "  rdflib.term.URIRef('file:///global/homes/s/sleak/Monitoring/Resilience/LogSet/examples/nersc#'))]"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#import rdflib.tools.rdf2dot\n",
    "#stream = open('test.dot', 'w')\n",
    "#rdflib.tools.rdf2dot.rdf2dot(graph, stream)\n",
    "#stream.close()\n",
    "\n",
    "[ns for ns in graph.namespaces()]\n",
    "#dir(rdflib.namespace)\n",
    "\n",
    "#print(rdflib.namespace._RDFNamespace)\n",
    "#print(rdflib.namespace.RDFS)\n",
    "#print (rdflib.namespace.namespaces())\n",
    "#, RDFS, OWL, XSD, FOAF, SKOS, DOAP, DC, DCTERMS, VOID: print (rdflib.namespace.i)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "@prefix : <http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/dict#> .\n",
      "@prefix adms: <http://www.w3.org/ns/adms#> .\n",
      "@prefix dcat: <http://www.w3.org/ns/dcat#> .\n",
      "@prefix dct: <http://purl.org/dc/terms/> .\n",
      "@prefix default1: <file:///global/homes/s/sleak/Monitoring/Resilience/LogSet/examples/cray-dict#> .\n",
      "@prefix default2: <http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#> .\n",
      "@prefix default3: <file:///global/homes/s/sleak/Monitoring/Resilience/LogSet/examples/nersc#> .\n",
      "@prefix dict: <http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/dict#> .\n",
      "@prefix foaf: <http://xmlns.com/foaf/0.1/> .\n",
      "@prefix logset: <http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#> .\n",
      "@prefix owl: <http://www.w3.org/2002/07/owl#> .\n",
      "@prefix rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .\n",
      "@prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#> .\n",
      "@prefix xml: <http://www.w3.org/XML/1998/namespace> .\n",
      "@prefix xsd: <http://www.w3.org/2001/XMLSchema#> .\n",
      "\n",
      "default1:aries_lcb_status a logset:LogSeries ;\n",
      "    logset:logFormat dict:filePerTimepoint ;\n",
      "    logset:logFormatInfo \"filepattern=<system>_aries_lcb_status.<timeYYYYMMDDHHmmss>.xz\" .\n",
      "\n",
      "default1:console_logfile a logset:LogSeries ;\n",
      "    logset:logFormat dict:timeStampedLogFile ;\n",
      "    logset:logFormatInfo \"filepattern=console\",\n",
      "        \"filepattern=console-<dateYYYYMMDD>\",\n",
      "        \"part_word=1\",\n",
      "        \"ts_word=0\" ;\n",
      "    rdfs:comment \"\"\" a console logfile is timestamped-line-per-entry, generally \n",
      "                     named like \"console-20170131\" and looks like:\n",
      "  2017-09-06T15:20:21.827169-07:00 corismw1 craylog: message type: console, connected to port: 5150\n",
      "  2017-09-06T15:20:21.827236-07:00 corismw1 craylog: testing connectivity\n",
      "  2017-09-06T15:20:22.075706-07:00 corismw1 starting\n",
      "  2017-09-06T15:22:42.809249-07:00 c2-0c0s0n1 Wait4Boot: Blade Controller Boot Protocol version - 1\n",
      "  2017-09-06T15:22:42.809276-07:00 c2-0c0s0n1 Wait4Boot: EXIT ---> PXE Boot\n",
      "                 \"\"\" .\n",
      "\n",
      "default1:consumer_logfile a logset:LogSeries ;\n",
      "    logset:logFormat dict:unstructuredFile ;\n",
      "    logset:logFormatInfo \"filepattern=consumer\",\n",
      "        \"filepattern=consumer-<dateYYYYMMDD>\" .\n",
      "\n",
      "default1:messages_logfile a logset:LogSeries ;\n",
      "    logset:logFormat dict:timeStampedLogFile ;\n",
      "    logset:logFormatInfo \"filepattern=messages\",\n",
      "        \"filepattern=messages-<dateYYYYMMDD>\",\n",
      "        \"part_word=2\",\n",
      "        \"ts_word=1\" .\n",
      "\n",
      "default3:cori_slurm a adms:Asset ;\n",
      "    logset:affects default3:cori ;\n",
      "    dct:description \"the batch system instance managing jobs on cori\" ;\n",
      "    dct:title \"cori slurm\" ;\n",
      "    dcat:landingPage <http://www.nersc.gov/users/computational-systems/cori/running-jobs/> .\n",
      "\n",
      "default3:cscratch1 a adms:Asset ;\n",
      "    logset:affects default3:cori,\n",
      "        default3:edison ;\n",
      "    dct:description \"a lustre filesystem attached to edison\" ;\n",
      "    dct:title \"edison scratch1\" ;\n",
      "    dcat:landingPage <http://www.nersc.gov/users/storage-and-file-systems/file-systems/> .\n",
      "\n",
      "default3:edison_slurm a adms:Asset ;\n",
      "    logset:affects default3:edison ;\n",
      "    dct:description \"the batch system instance managing jobs on edison\" ;\n",
      "    dct:title \"edison slurm\" ;\n",
      "    dcat:landingPage <http://www.nersc.gov/users/computational-systems/edison/running-jobs/> .\n",
      "\n",
      "default3:escratch1 a adms:Asset ;\n",
      "    logset:affects default3:edison ;\n",
      "    dct:description \"a lustre filesystem attached to edison\" ;\n",
      "    dct:title \"edison scratch1\" ;\n",
      "    dcat:landingPage <http://www.nersc.gov/users/storage-and-file-systems/file-systems/> .\n",
      "\n",
      "default3:escratch3 a adms:Asset ;\n",
      "    logset:affects default3:edison ;\n",
      "    dct:description \"a lustre filesystem attached to edison\" ;\n",
      "    dct:title \"edison scratch2\",\n",
      "        \"edison scratch3\" ;\n",
      "    dcat:landingPage <http://www.nersc.gov/users/storage-and-file-systems/file-systems/> .\n",
      "\n",
      "default3:global_home a adms:Asset ;\n",
      "    logset:affects default3:cori,\n",
      "        default3:edison ;\n",
      "    dct:description \"the $HOME filesystem shared by all NERSC systems\" ;\n",
      "    dct:title \"global home\" ;\n",
      "    dcat:landingPage <http://www.nersc.gov/users/storage-and-file-systems/file-systems/global-home/> .\n",
      "\n",
      "default3:nersc a foaf:Organization ;\n",
      "    foaf:name \"NERSC\" ;\n",
      "    foaf:page <http://www.nersc.gov/> .\n",
      "\n",
      "dict:annotationDB a logset:LogSeries ;\n",
      "    logset:logFormat dict:sqlite3 .\n",
      "\n",
      "dict:binaryFile a logset:LogFormatType ;\n",
      "    dcat:mediaType \"application/octet-stream\" .\n",
      "\n",
      "dict:dateYYYYMMDD a dict:FilenamePattern ;\n",
      "    dict:regex \"(?P<year>20[0-9]{2})(?P<month>0[1-9]|1[0-2])(?P<day>[0-3][0-9])\" ;\n",
      "    dict:tag \"<dateYYYYMMDD>\" .\n",
      "\n",
      "dict:regex a owl:DatatypeProperty ;\n",
      "    rdfs:domain dict:FilenamePattern ;\n",
      "    rdfs:range rdfs:Literal .\n",
      "\n",
      "dict:system a dict:FilenamePattern ;\n",
      "    dict:regex \"(?P<system>[a-z][a-z0-9]+)\" ;\n",
      "    dict:tag \"<system>\" .\n",
      "\n",
      "dict:tag a owl:DatatypeProperty ;\n",
      "    rdfs:domain dict:FilenamePattern ;\n",
      "    rdfs:range rdfs:Literal .\n",
      "\n",
      "dict:timeYYYYMMDDHHmmss a dict:FilenamePattern ;\n",
      "    dict:regex \"(?P<year>20[0-9]{2})(?P<month>0[1-9]|1[0-2])(?P<day>[0-3][0-9])(?P<hour>[01][0-9]|2[0-3])(?P<minute>[0-5][0-9])(?P<second>[0-5][0-9])\" ;\n",
      "    dict:tag \"<timeYYYYMMDDHHmmss>\" .\n",
      "\n",
      "dict:timeYYYYMMDDtHHmmss a dict:FilenamePattern ;\n",
      "    dict:regex \"(?P<year>20[0-9]{2})(?P<month>0[1-9]|1[0-2])(?P<day>[0-3][0-9])t(?P<hour>[01][0-9]|2[0-3])(?P<minute>[0-5][0-9])(?P<second>[0-5][0-9])\" ;\n",
      "    dict:tag \"<timeYYYYMMDDtHHmmss>\" .\n",
      "\n",
      "logset: a owl:Ontology ;\n",
      "    rdfs:label \"LogSet\" ;\n",
      "    dct:title \"the LogSet vocabulary\" .\n",
      "\n",
      "logset:affects a owl:ObjectProperty ;\n",
      "    rdfs:comment \"\"\" Components in an HPC center are not a strict hierarchy,\n",
      "                     eg a filesystem might be shared by multiple systems. \n",
      "                     So we connect related systems and subsystems with an \n",
      "                     \"affects\" relationship\n",
      "                 \"\"\" ;\n",
      "    rdfs:domain adms:Asset ;\n",
      "    rdfs:range adms:Asset .\n",
      "\n",
      "logset:endDate a owl:DatatypeProperty ;\n",
      "    rdfs:domain dct:PeriodOfTime ;\n",
      "    rdfs:range xsd:dateTime .\n",
      "\n",
      "logset:logFormatInfo a owl:DatatypeProperty ;\n",
      "    rdfs:comment \"\"\" dictionary-like information that a LogFormatType handler \n",
      "                     class can use to interpret a specific type of logfile. Each \n",
      "                     logFormatInfo property should be a literal like \n",
      "                     \"key=value\". Eg, a console_logfile and message_logfile are\n",
      "                     both timeStampedLogFile, but in the console log the \n",
      "                     timestamp is the first \"word\" on each line, while in the \n",
      "                     message log the timestamp is the second word on each line.\n",
      "                     So console_logfile can have recordInfoProperty \"ts_word=0\"\n",
      "                     (and \"part_word=1\" for system component) \n",
      "                 \"\"\" ;\n",
      "    rdfs:domain logset:LogSeries ;\n",
      "    rdfs:range rdfs:Literal .\n",
      "\n",
      "logset:specificSubjectLabel a owl:DatatypeProperty ;\n",
      "    rdfs:comment \"\"\" While major system components are represented by an adms:Asset,\n",
      "                     representing specific smaller components (such as compute nodes\n",
      "                     or hsn links) is impractical. To indicate that a log (or LogSet)\n",
      "                     is about eg a specific node, or a subset of links, this literal \n",
      "                     label can be added\n",
      "                 \"\"\" ;\n",
      "    rdfs:domain [ owl:UnionOf ( logset:LogSet logset:ConcreteLog ) ] ;\n",
      "    rdfs:range rdfs:Literal .\n",
      "\n",
      "logset:startDate a owl:DatatypeProperty ;\n",
      "    rdfs:domain dct:PeriodOfTime ;\n",
      "    rdfs:range xsd:dateTime .\n",
      "\n",
      "dict:filePerTimepoint a logset:LogFormatType ;\n",
      "    dcat:mediaType \"inode/directory\" .\n",
      "\n",
      "dict:sqlite3 a logset:LogFormatType ;\n",
      "    dcat:mediaType \"application/x-sqlite3\" .\n",
      "\n",
      "dict:unstructuredFile a logset:LogFormatType ;\n",
      "    dcat:mediaType \"text/plain\" .\n",
      "\n",
      "logset:isInstanceOf a owl:FunctionalProperty,\n",
      "        owl:ObjectProperty ;\n",
      "    rdfs:comment \"Links a LogSeries to log data (eg a log file)\" ;\n",
      "    rdfs:domain logset:ConcreteLog ;\n",
      "    rdfs:range logset:LogSeries .\n",
      "\n",
      "logset:logFormat a owl:FunctionalProperty,\n",
      "        owl:ObjectProperty ;\n",
      "    rdfs:comment \"\"\" An entity indicating how a LogSeries is formatted, from \n",
      "                     which tools can decide how to process it.\n",
      "                     For example, most logs are timestamped-line-per-entry (in\n",
      "                     a file or stream) but some are a timestamped multiline \n",
      "                     block, others have a file per timestamp and contain a \n",
      "                     table, others hove no obvious structure at all. \n",
      "                     problem: what if the \n",
      "                     same log might be in a native file or as records in a \n",
      "                     database? then the logFormat should provide enough \n",
      "                     information for a tool to answer questions about it?\n",
      "                     or does that count as a different logseries?\n",
      "                 \"\"\" ;\n",
      "    rdfs:domain logset:LogSeries ;\n",
      "    rdfs:range logset:LogFormatType .\n",
      "\n",
      "logset:subject a owl:ObjectProperty ;\n",
      "    rdfs:comment \"\"\" The Asset whose state this LogSet or ConcreteLog describes.\n",
      "                     (eg a console-log might be for nersc:edison)\n",
      "                 \"\"\" ;\n",
      "    rdfs:domain [ owl:UnionOf ( logset:LogSet logset:ConcreteLog ) ] ;\n",
      "    rdfs:range adms:Asset .\n",
      "\n",
      "dict:timeStampedLogFile a logset:LogFormatType ;\n",
      "    dcat:mediaType \"text/plain\" .\n",
      "\n",
      "logset:LogSet a owl:Class ;\n",
      "    rdfs:comment \"\"\" A LogSet is a Dataset for a specific system, spanning a \n",
      "                     specific timeframe (eg a Cray boot session on NERSC Cori). \n",
      "                     It is recommended but not enforced that a LogSet instance \n",
      "                     should have certain properties describing its provenance:   \n",
      "                     # dct:title         a rdfs:Literal\n",
      "                     # dct:description   a rdfs:Literal\n",
      "                     # dct:publisher     a foaf:Organization\n",
      "                     # dct:contactPoint  a vcard:Kind\n",
      "                     (publisher and contactPoint are especially useful when the\n",
      "                     actual log data is not directly accessible to people or \n",
      "                     tools using the metadata, so that having identified that \n",
      "                     data exists, they can contact someone to request access).\n",
      "                     The actual files (or db queries etc) of the logs are \n",
      "                     described as a :ConcreteLog, based on dcat:Distribution.\n",
      "                     A LogSet is epected to be defined in its own index file\n",
      "                     and included in a dcat:Catalog\n",
      "                 \"\"\" ;\n",
      "    rdfs:subClassOf [ a owl:Restriction ;\n",
      "            owl:onProperty logset:subject ],\n",
      "        [ a owl:Restriction ;\n",
      "            owl:cardinality 1 ;\n",
      "            owl:onProperty dct:temporal ],\n",
      "        dcat:Dataset .\n",
      "\n",
      "default3:cori a adms:Asset ;\n",
      "    dct:description \"cori is the 12000-node Cray XC40 at NERSC\" ;\n",
      "    dct:title \"cori\" ;\n",
      "    dcat:landingPage <http://www.nersc.gov/systems/cori/> .\n",
      "\n",
      "logset:ConcreteLog a owl:Class ;\n",
      "    rdfs:label \"ConcreteLog\" ;\n",
      "    rdfs:comment \"\"\" An actual, specific log, eg a File or database or web \n",
      "                     service, with knowledge of how to handle this type of \n",
      "                     log in this format. Eg, the actual files in a p0 package\n",
      "                     are ConcreteLog objects.\n",
      "                     Should have either a dcat:downloadURL or a dcat:accessURL.\n",
      "                     May have a logset:subject (assumed from LogSet if not) and\n",
      "                     a logset:specificSubjectLabel\n",
      "                 \"\"\" ;\n",
      "    rdfs:subClassOf [ a owl:Restriction ;\n",
      "            owl:cardinality 1 ;\n",
      "            owl:onProperty logset:isInstanceOf ],\n",
      "        [ a owl:Restriction ;\n",
      "            owl:cardinality 1 ;\n",
      "            owl:onProperty dct:temporal ],\n",
      "        dcat:Distribution .\n",
      "\n",
      "default3:edison a adms:Asset ;\n",
      "    dct:description \"edison is the 6000-node Cray XC30 at NERSC\" ;\n",
      "    dct:title \"edison\" ;\n",
      "    dcat:landingPage <http://www.nersc.gov/systems/edison/> .\n",
      "\n",
      "dict:FilenamePattern a owl:Class .\n",
      "\n",
      "logset:LogFormatType a owl:Class ;\n",
      "    rdfs:comment \"\"\" An entity representing how log data is organized, in order \n",
      "                     to help tools decide how to handle a give log.  \n",
      "                     For example, most logs are timestamped-line-per-entry but\n",
      "                     some are a timestamped multiline block, others have a file\n",
      "                     per timestamp and contain a table, others hove no obvious \n",
      "                     structure at all. \n",
      "                     It is likely valuable for a LogFormatType to include a\n",
      "                     dcat:mediaType property, eg \"text/plain\" \n",
      "                     A LogFormatType is expected to be defined in a data \n",
      "                     dictionary and to correspond to a handler class for logs in\n",
      "                     that format\n",
      "                 \"\"\" .\n",
      "\n",
      "logset:LogSeries a owl:Class ;\n",
      "    rdfs:comment \"\"\" A \"type\" of logfile, eg a console or outage log. Might be\n",
      "                     specific to a type of system, or OS version, but common to\n",
      "                     systems of that type (eg Cray with CNL6). Can be used by\n",
      "                     tools to indicate how to handle a log. Must have a property\n",
      "                     indicating the \"canonical\" format that tools can assume on.\n",
      "                     Note: we may need to add an \"equivalentTo\" property for \n",
      "                     LogSeries that can be in multiple places and formats, eg a\n",
      "                     text log on a server and an index in an ElasticSearch db.\n",
      "                     A LogSeries is expected to be defined in a data dictionary\n",
      "                 \"\"\" ;\n",
      "    rdfs:subClassOf [ a owl:Restriction ;\n",
      "            owl:cardinality 1 ;\n",
      "            owl:onProperty logset:logFormat ] .\n",
      "\n",
      "\n"
     ]
    }
   ],
   "source": [
    "dump(graph)\n",
    "# find datasets, read them, and if they are LogSets, add them to the graph:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [],
   "source": [
    "for row in graph.query('''select ?id ?pred ?obj where { ?id a logset:LogSet . \n",
    "            ?id ?pred ?obj . }'''):\n",
    "    #print ('{0} {1} {2}'.format(str(row[0]),str(row[1]),str(row[2])))\n",
    "    #print ('{0} {1}'.format(str(row[1]),str(row[2])))\n",
    "    print (str(row[0]))\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "regexs for common file patterns:\n",
      "<timeYYYYMMDDHHmmss>    (?P<year>20[0-9]{2})(?P<month>0[1-9]|1[0-2])(?P<day>[0-3][0-9])(?P<hour>[01][0-9]|2[0-3])(?P<minute>[0-5][0-9])(?P<second>[0-5][0-9])\n",
      "<dateYYYYMMDD>    (?P<year>20[0-9]{2})(?P<month>0[1-9]|1[0-2])(?P<day>[0-3][0-9])\n",
      "<system>    (?P<system>[a-z][a-z0-9]+)\n",
      "<timeYYYYMMDDtHHmmss>    (?P<year>20[0-9]{2})(?P<month>0[1-9]|1[0-2])(?P<day>[0-3][0-9])t(?P<hour>[01][0-9]|2[0-3])(?P<minute>[0-5][0-9])(?P<second>[0-5][0-9])\n",
      "\n",
      "known LogSeries patterns:\n",
      "(?P<system>[a-z][a-z0-9]+)_aries_lcb_status.(?P<year>20[0-9]{2})(?P<month>0[1-9]|1[0-2])(?P<day>[0-3][0-9])(?P<hour>[01][0-9]|2[0-3])(?P<minute>[0-5][0-9])(?P<second>[0-5][0-9]).xz\n",
      "consumer-(?P<year>20[0-9]{2})(?P<month>0[1-9]|1[0-2])(?P<day>[0-3][0-9])\n",
      "consumer\n",
      "messages-(?P<year>20[0-9]{2})(?P<month>0[1-9]|1[0-2])(?P<day>[0-3][0-9])\n",
      "messages\n",
      "console-(?P<year>20[0-9]{2})(?P<month>0[1-9]|1[0-2])(?P<day>[0-3][0-9])\n",
      "console\n",
      "\n",
      "{'<timeYYYYMMDDHHmmss>': '(?P<year>20[0-9]{2})(?P<month>0[1-9]|1[0-2])(?P<day>[0-3][0-9])(?P<hour>[01][0-9]|2[0-3])(?P<minute>[0-5][0-9])(?P<second>[0-5][0-9])', '<dateYYYYMMDD>': '(?P<year>20[0-9]{2})(?P<month>0[1-9]|1[0-2])(?P<day>[0-3][0-9])', '<system>': '(?P<system>[a-z][a-z0-9]+)', '<timeYYYYMMDDtHHmmss>': '(?P<year>20[0-9]{2})(?P<month>0[1-9]|1[0-2])(?P<day>[0-3][0-9])t(?P<hour>[01][0-9]|2[0-3])(?P<minute>[0-5][0-9])(?P<second>[0-5][0-9])'}\n",
      "\n",
      "{re.compile('(?P<system>[a-z][a-z0-9]+)_aries_lcb_status.(?P<year>20[0-9]{2})(?P<month>0[1-9]|1[0-2])(?P<day>[0-3][0-9])(?P<hour>[01][0-9]|2[0-3])(?P<minute>[0-5][0-9])(?P<second>[0-5][0-9]).xz'): (rdflib.term.URIRef('file:///global/homes/s/sleak/Monitoring/Resilience/LogSet/examples/cray-dict#aries_lcb_status'), rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/dict#filePerTimepoint'), rdflib.term.Literal('inode/directory')), re.compile('consumer-(?P<year>20[0-9]{2})(?P<month>0[1-9]|1[0-2])(?P<day>[0-3][0-9])'): (rdflib.term.URIRef('file:///global/homes/s/sleak/Monitoring/Resilience/LogSet/examples/cray-dict#consumer_logfile'), rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/dict#unstructuredFile'), rdflib.term.Literal('text/plain')), re.compile('consumer'): (rdflib.term.URIRef('file:///global/homes/s/sleak/Monitoring/Resilience/LogSet/examples/cray-dict#consumer_logfile'), rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/dict#unstructuredFile'), rdflib.term.Literal('text/plain')), re.compile('messages-(?P<year>20[0-9]{2})(?P<month>0[1-9]|1[0-2])(?P<day>[0-3][0-9])'): (rdflib.term.URIRef('file:///global/homes/s/sleak/Monitoring/Resilience/LogSet/examples/cray-dict#messages_logfile'), rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/dict#timeStampedLogFile'), rdflib.term.Literal('text/plain')), re.compile('messages'): (rdflib.term.URIRef('file:///global/homes/s/sleak/Monitoring/Resilience/LogSet/examples/cray-dict#messages_logfile'), rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/dict#timeStampedLogFile'), rdflib.term.Literal('text/plain')), re.compile('console-(?P<year>20[0-9]{2})(?P<month>0[1-9]|1[0-2])(?P<day>[0-3][0-9])'): (rdflib.term.URIRef('file:///global/homes/s/sleak/Monitoring/Resilience/LogSet/examples/cray-dict#console_logfile'), rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/dict#timeStampedLogFile'), rdflib.term.Literal('text/plain')), re.compile('console'): (rdflib.term.URIRef('file:///global/homes/s/sleak/Monitoring/Resilience/LogSet/examples/cray-dict#console_logfile'), rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/dict#timeStampedLogFile'), rdflib.term.Literal('text/plain'))}\n"
     ]
    }
   ],
   "source": [
    "print(\"regexs for common file patterns:\")\n",
    "query = '''select ?tag ?regex where {\n",
    "    ?id a dict:FilenamePattern .\n",
    "    ?id dict:tag ?tag .\n",
    "    ?id dict:regex ?regex .\n",
    "}'''\n",
    "patterns = {} # tag: pattern\n",
    "for row in graph.query(query):\n",
    "    patterns[str(row[0])] = str(row[1])\n",
    "    print(str(row[0]) + \"    \" + str(row[1]))\n",
    "\n",
    "print (\"\\nknown LogSeries patterns:\")\n",
    "query = '''select ?filepattern ?logseries ?logfmt ?mediatype where {\n",
    "?logseries a logset:LogSeries .\n",
    "?logseries logset:logFormatInfo ?filepattern .\n",
    "?logseries logset:logFormat ?logfmt .\n",
    "optional { ?logfmt dcat:mediaType ?mediatype } .\n",
    "filter regex(?filepattern, \"^filepattern=\") .\n",
    "}'''\n",
    "import re\n",
    "regexs = {} # regex: (logseries, logformat, mediatype)\n",
    "\n",
    "# require tags to be alphanumeric:\n",
    "tags = re.compile('(<\\w+>)')\n",
    "\n",
    "for row in graph.query(query):\n",
    "    fp = str(row[0]).partition('=')[2]\n",
    "    plist = tags.split(fp)\n",
    "    # replace tags with patterns:\n",
    "    plist2 = [ patterns[t] for t in plist[1::2] ]\n",
    "    # merge them back into a string (which is the \"expanded\" pattern):\n",
    "    p = ''.join(sum(zip(plist[:-1:2],plist2),())) + plist[-1]\n",
    "    print(p)\n",
    "    regexs[re.compile(p)] = row[1:]\n",
    "print(\"\")\n",
    "print(patterns)\n",
    "print(\"\")\n",
    "print(regexs)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "ename": "Exception",
     "evalue": "no matching pattern",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m\u001b[0m",
      "\u001b[0;31mException\u001b[0mTraceback (most recent call last)",
      "\u001b[0;32m<ipython-input-33-be77bdd7ac14>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m()\u001b[0m\n\u001b[1;32m     39\u001b[0m         \u001b[0;32mbreak\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     40\u001b[0m \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 41\u001b[0;31m     \u001b[0;32mraise\u001b[0m \u001b[0mException\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"no matching pattern\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     42\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     43\u001b[0m \u001b[0;31m#console_logfile = LogsGraph.get(\"cray\", \"console_logfile\")\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mException\u001b[0m: no matching pattern"
     ]
    }
   ],
   "source": [
    "# make a new namespace in the graph for my index:\n",
    "#dir(graph.namespace_manager)\n",
    "ns = rdflib.Namespace(\"http://example.org/myindex#\")\n",
    "#dir(ns)\n",
    "#ns.add(\"bob\")\n",
    "#ns['bob']\n",
    "#ns[\"file1\"]\n",
    "newindex = rdflib.ConjunctiveGraph()\n",
    "query = '''select ?type ?prop ?value  where {\n",
    "?type a owl:Class .\n",
    "?type ?prop ?value .\n",
    "}'''\n",
    "#for row in graph.query(query): \n",
    "#    print(row)\n",
    "#[i for i in graph.contexts()]\n",
    "#logset = [n[1] for n in graph.namespaces() if n[0]=='logset'][0]\n",
    "#logset + 'ConcreteLog'\n",
    "#concretelog = rdflib.URIRef(logset + 'ConcreteLog')\n",
    "#print(dir(rdflib.RDF))\n",
    "concretelog = LogsGraph.get(\"logset\",\"ConcreteLog\")\n",
    "#print(concretelog)\n",
    "#ls = LogsGraph.getns(\"logset\")\n",
    "#print(ls)\n",
    "#print(type(rdflib.URIRef(ls + \"ConcreteLog\")))\n",
    "#print((concretelog,rdflib.RDF.type,rdflib.OWL.Class) in graph)\n",
    "\n",
    "import random, string\n",
    "def ran_str(len):\n",
    "    # produce a string of random letters, of a given length\n",
    "    return ''.join([random.choice(string.ascii_lowercase) for i in range(len)])\n",
    "\n",
    "dcat = rdflib.Namespace(LogsGraph.getns('dcat'))\n",
    "\n",
    "fname = \"console-20170906\"\n",
    "for p in patterns.keys():\n",
    "    if p.match(fname):\n",
    "        series = patterns[p][0]\n",
    "        fmt = patterns[p][1]\n",
    "        break\n",
    "else:\n",
    "    raise Exception(\"no matching pattern\")\n",
    "\n",
    "#console_logfile = LogsGraph.get(\"cray\", \"console_logfile\")\n",
    "\n",
    "id = ran_str(8)\n",
    "#print(ns[id])\n",
    "#print(rdflib.RDF.type)\n",
    "#print(concretelog)\n",
    "#print(dcat['downloadURL'])\n",
    "#print(rdflib.URIRef(\"file:///some/location\"))\n",
    "newindex.add( (ns[id], rdflib.RDF.type, concretelog ))\n",
    "newindex.add( (ns[id], dcat['downloadURL'], rdflib.URIRef(\"file:///some/location/\" + fname)) )\n",
    "newindex.add( (ns[id], LogsGraph.get(\"logset\",\"isInstanceOf\"), series) )\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "\n",
    "#graph.add(rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#ConcreteLog'))\n",
    "#rdflib.term.URIRef(logset['type'])\n",
    "#graph.labels()\n",
    "#graph.add( (ns[\"file1\"], rdflib.RDF.type, logset + 'ConcreteLog'))\n",
    "#newindex.add(ns['bob'])\n",
    "#newindex.add(ns['mary'])\n",
    "query = '''SELECT ?id ?what ?path\n",
    "WHERE {\n",
    "?id a logset:ConcreteLog . \n",
    "?id dcat:downloadURL ?path .\n",
    "?id logset:isInstanceOf ?what .\n",
    "} '''\n",
    "#\n",
    "#print(\"concretelogs:\")\n",
    "#for row in graph.query(query):\n",
    "#    print(row)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python [default]",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
