{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "/global/u1/s/sleak/Monitoring/Resilience/LogSet/etc/vocab.ttl\n",
      "/global/u1/s/sleak/Monitoring/Resilience/LogSet/etc/dict.ttl\n"
     ]
    }
   ],
   "source": [
    "import os\n",
    "root = os.getcwd().rsplit('/',1)[0]\n",
    "vocab_path = '{0:s}/etc/vocab.ttl'.format(root)\n",
    "dict_path = '{0:s}/etc/dict.ttl'.format(root)\n",
    "print(vocab_path)\n",
    "print(dict_path)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "@prefix : <https://raw.githubusercontent.com/NERSC/LogSet/master/etc/dict#> .\n",
      "@prefix adms: <http://www.w3.org/ns/adms#> .\n",
      "@prefix dcat: <http://www.w3.org/ns/dcat#> .\n",
      "@prefix dct: <http://purl.org/dc/terms/> .\n",
      "@prefix default1: <https://raw.githubusercontent.com/NERSC/LogSet/master/etc/vocab#> .\n",
      "@prefix foaf: <http://xmlns.com/foaf/0.1/> .\n",
      "@prefix logset: <https://raw.githubusercontent.com/NERSC/LogSet/master/etc/vocab#> .\n",
      "@prefix owl: <http://www.w3.org/2002/07/owl#> .\n",
      "@prefix rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .\n",
      "@prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#> .\n",
      "@prefix xml: <http://www.w3.org/XML/1998/namespace> .\n",
      "@prefix xsd: <http://www.w3.org/2001/XMLSchema#> .\n",
      "\n",
      ":annotationDB a default1:LogSeries ;\n",
      "    default1:logFormat :sqlite3 .\n",
      "\n",
      ":binaryFile a default1:LogFormatType .\n",
      "\n",
      ":console_logfile a default1:LogSeries ;\n",
      "    default1:logFormat :timeStampedLogFile ;\n",
      "    default1:logFormatInfo \"filepattern=console\",\n",
      "        \"filepattern=console-<dateYYYYMMDD>\",\n",
      "        \"part_word=1\",\n",
      "        \"ts_word=0\" .\n",
      "\n",
      ":consumer_logfile a default1:LogSeries ;\n",
      "    default1:logFormat :unstructuredFile ;\n",
      "    default1:logFormatInfo \"filepattern=consumer\",\n",
      "        \"filepattern=consumer-<dateYYYYMMDD>\" .\n",
      "\n",
      ":filePerTimepoint a default1:LogFormatType .\n",
      "\n",
      ":messages_logfile a default1:LogSeries ;\n",
      "    default1:logFormat :timeStampedLogFile ;\n",
      "    default1:logFormatInfo \"filepattern=messages\",\n",
      "        \"filepattern=messages-<dateYYYYMMDD>\",\n",
      "        \"part_word=2\",\n",
      "        \"ts_word=1\" .\n",
      "\n",
      ":unknownLogFormat a default1:LogFormatType .\n",
      "\n",
      "default1:affects a owl:ObjectProperty ;\n",
      "    rdfs:comment \"\"\" Components in an HPC center are not a strict hierarchy,\n",
      "                     eg a filesystem might be shared by multiple systems. \n",
      "                     So we connect related systems and subsystems with an \n",
      "                     \"affects\" relationship\n",
      "                 \"\"\" ;\n",
      "    rdfs:domain adms:Asset ;\n",
      "    rdfs:range adms:Asset .\n",
      "\n",
      "default1:assets a owl:ObjectProperty ;\n",
      "    rdfs:comment \"\"\" A single catalog has LogSets for certain assets, eg \n",
      "                     nersc-catalog will have logs for edison and cori, while \n",
      "                     snl-catalog will have logs for mutrino and trinity\n",
      "                 \"\"\" ;\n",
      "    rdfs:domain dcat:Catalog ;\n",
      "    rdfs:range adms:Asset .\n",
      "\n",
      "default1:endDate a owl:DatatypeProperty ;\n",
      "    rdfs:domain dct:PeriodOfTime ;\n",
      "    rdfs:range xsd:dateTime .\n",
      "\n",
      "default1:logFormatInfo a owl:DatatypeProperty ;\n",
      "    rdfs:comment \"\"\" dictionary-like information that a LogFormatType handler \n",
      "                     class can use to interpret a specific type of logfile. Each \n",
      "                     logFormatInfo property should be a literal like \n",
      "                     \"key=value\". Eg, a console_logfile and message_logfile are\n",
      "                     both timeStampedLogFile, but in the console log the \n",
      "                     timestamp is the first \"word\" on each line, while in the \n",
      "                     message log the timestamp is the second word on each line.\n",
      "                     So console_logfile can have recordInfoProperty \"ts_word=0\"\n",
      "                     (and \"part_word=1\" for system component) \n",
      "                 \"\"\" ;\n",
      "    rdfs:domain default1:LogSeries ;\n",
      "    rdfs:range rdfs:Literal .\n",
      "\n",
      "default1:peers a owl:ObjectProperty ;\n",
      "    rdfs:comment \"\"\" URIs for other catalogs, analagous to html links forming \n",
      "                     the www\n",
      "                 \"\"\" ;\n",
      "    rdfs:domain dcat:Catalog ;\n",
      "    rdfs:range dcat:Catalog .\n",
      "\n",
      "default1:startDate a owl:DatatypeProperty ;\n",
      "    rdfs:domain dct:PeriodOfTime ;\n",
      "    rdfs:range xsd:dateTime .\n",
      "\n",
      ":sqlite3 a default1:LogFormatType .\n",
      "\n",
      "default1:ConcreteLog a owl:Class ;\n",
      "    rdfs:comment \"\"\" storage of a specific log, eg a File or database or web \n",
      "                     service, with knowledge of how to handle this type of \n",
      "                     log in this format. Eg, the actual files in a p0 package\n",
      "                     are ConcreteLog objects \n",
      "                 \"\"\" ;\n",
      "    rdfs:subClassOf [ a owl:Restriction ;\n",
      "            owl:cardinality 1 ;\n",
      "            owl:onProperty default1:isInstanceOf ],\n",
      "        dcat:Distribution .\n",
      "\n",
      "default1:LogSet a owl:Class ;\n",
      "    rdfs:comment \"\"\" A LogSet is a Dataset for a specific system, spanning a \n",
      "                     specific timeframe (eg a Cray boot session on NERSC Cori). \n",
      "                     It is recommended but not enforced that a LogSet instance \n",
      "                     should have certain properties describing its provenance:   \n",
      "                     # dct:title         a rdfs:Literal\n",
      "                     # dct:description   a rdfs:Literal\n",
      "                     # dct:publisher     a foaf:Organization\n",
      "                     # dct:contactPoint  a vcard:Kind\n",
      "                     The actual files (or db queries etc) of the logs are \n",
      "                     described as a :ConcreteLog, based on dcat:Distribution\n",
      "                 \"\"\" ;\n",
      "    rdfs:subClassOf [ a owl:Restriction ;\n",
      "            owl:cardinality 1 ;\n",
      "            owl:onProperty dct:temporal ],\n",
      "        [ a owl:Restriction ;\n",
      "            owl:onProperty default1:subject ],\n",
      "        dcat:Dataset .\n",
      "\n",
      "default1:isInstanceOf a owl:FunctionalProperty,\n",
      "        owl:ObjectProperty ;\n",
      "    rdfs:comment \"Links a LogSeries to log data (eg a log file)\" ;\n",
      "    rdfs:domain default1:ConcreteLog ;\n",
      "    rdfs:range default1:LogSeries .\n",
      "\n",
      "default1:logFormat a owl:FunctionalProperty,\n",
      "        owl:ObjectProperty ;\n",
      "    rdfs:comment \"\"\" An entity indicating how a LogSeries is formatted, from \n",
      "                     which tools can decide how to process it.\n",
      "                     For example, most logs are timestamped-line-per-entry (in\n",
      "                     a file or stream) but some are a timestamped multiline \n",
      "                     block, others have a file per timestamp and contain a \n",
      "                     table, others hove no obvious structure at all. \n",
      "                     problem: what if the \n",
      "                     same log might be in a native file or as records in a \n",
      "                     database? then the logFormat should provide enough \n",
      "                     information for a tool to answer questions about it?\n",
      "                     or does that count as a different logseries?\n",
      "                 \"\"\" ;\n",
      "    rdfs:domain default1:LogSeries ;\n",
      "    rdfs:range default1:LogFormatType ;\n",
      "    owl:oneOf ( :timeStampedLogFile :unstructuredFile ) .\n",
      "\n",
      "default1:subject a owl:ObjectProperty ;\n",
      "    rdfs:comment \"\"\" A LogSet has logs about a specific system or component,\n",
      "                     and a LogSeries might be about a specific component \n",
      "                     within the system the LogSet documents \n",
      "                 \"\"\" ;\n",
      "    rdfs:domain [ owl:UnionOf ( default1:LogSet default1:LogSeries ) ] ;\n",
      "    rdfs:range adms:Asset .\n",
      "\n",
      ":unstructuredFile a default1:LogFormatType .\n",
      "\n",
      ":timeStampedLogFile a default1:LogFormatType .\n",
      "\n",
      "default1:LogFormatType a owl:Class ;\n",
      "    rdfs:comment \"\"\" An entity representing how log data is organized, in order \n",
      "                     to help tools decide how to handle a give log.  \n",
      "                     For example, most logs are timestamped-line-per-entry but\n",
      "                     some are a timestamped multiline block, others have a file\n",
      "                     per timestamp and contain a table, others hove no obvious \n",
      "                     structure at all. \n",
      "                     A LogFormatType is expected to correspond to a handler \n",
      "                     class for logs in that format\n",
      "                 \"\"\" .\n",
      "\n",
      "default1:LogSeries a owl:Class ;\n",
      "    rdfs:comment \"\"\" A \"type\" of logfile, eg a console or outage log. Can be \n",
      "                     used by tools to indicate how to handle a log. Must have\n",
      "                     a property indicating the \"canonical\" format that tools\n",
      "                     can assume on\n",
      "                     hmm: if we have multiple source for same type of log (eg \n",
      "                     version in elasticsearch), then maybe we need an \n",
      "                     \"equivalentTo\" property to link them?\n",
      "                 \"\"\" ;\n",
      "    rdfs:subClassOf [ a owl:Restriction ;\n",
      "            owl:cardinality 1 ;\n",
      "            owl:onProperty default1:logFormat ] .\n",
      "\n",
      "\n"
     ]
    }
   ],
   "source": [
    "import sys\n",
    "sys.path.append('/global/homes/s/sleak/.local/cori/3.6-anaconda-4.4/lib/python3.6/site-packages')\n",
    "import rdflib\n",
    "#graph = rdflib.ConjunctiveGraph().parse(vocab_path, format='turtle')\n",
    "gvocab = rdflib.ConjunctiveGraph().parse(vocab_path, format='turtle')\n",
    "\n",
    "# now add the data dictionary:\n",
    "#graph.parse(dict_path, format='turtle')\n",
    "gdict = rdflib.ConjunctiveGraph().parse(dict_path, format='turtle')\n",
    "#gdict = rdflib.ConjunctiveGraph().parse(dict_path)\n",
    "graph = gvocab + gdict\n",
    "\n",
    "print(graph.serialize(format='n3').decode('ascii'))\n",
    "#print(gdict.serialize(format='n3').decode('ascii'))\n",
    "#print(graph.identifier)\n",
    "#print(gvocab.identifier)\n",
    "#print(gdict.identifier)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "@prefix : <https://raw.githubusercontent.com/NERSC/LogSet/master/etc/dict#> .\n",
      "@prefix adms: <http://www.w3.org/ns/adms#> .\n",
      "@prefix dcat: <http://www.w3.org/ns/dcat#> .\n",
      "@prefix dct: <http://purl.org/dc/terms/> .\n",
      "@prefix default1: <https://raw.githubusercontent.com/NERSC/LogSet/master/etc/vocab#> .\n",
      "@prefix default2: <file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#> .\n",
      "@prefix dict: <https://raw.githubusercontent.com/NERSC/LogSet/master/etc/dict#> .\n",
      "@prefix entities: <file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/nersc-entities#> .\n",
      "@prefix foaf: <http://xmlns.com/foaf/0.1/> .\n",
      "@prefix logset: <https://raw.githubusercontent.com/NERSC/LogSet/master/etc/vocab#> .\n",
      "@prefix owl: <http://www.w3.org/2002/07/owl#> .\n",
      "@prefix rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .\n",
      "@prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#> .\n",
      "@prefix xml: <http://www.w3.org/XML/1998/namespace> .\n",
      "@prefix xsd: <http://www.w3.org/2001/XMLSchema#> .\n",
      "\n",
      "default2:sample_data a logset:LogSet ;\n",
      "    dct:description \"a partial sample of cori log data for testing logset tools\" ;\n",
      "    dct:temporal [ a dct:PeriodOfTime ;\n",
      "            logset:endDate \"2017-09-07T15:22:42.809617-07:00\"^^xsd:dateTime ;\n",
      "            logset:startDate \"2017-09-06T15:18:20.827169-07:00\"^^xsd:dateTime ] ;\n",
      "    dcat:distribution [ a logset:ConcreteLog ;\n",
      "            dct:temporal [ a dct:PeriodOfTime ;\n",
      "                    logset:endDate \"2017-09-06T15:22:42.809617-07:00\"^^xsd:dateTime ;\n",
      "                    logset:startDate \"2017-09-06T15:20:21.827169-07:00\"^^xsd:dateTime ] ;\n",
      "            dcat:downloadURL \"p0-20170906t151820/console-20170906\" ;\n",
      "            dcat:mediaType \"text/plain\" ;\n",
      "            logset:isInstanceOf :console_logfile ],\n",
      "        [ a logset:ConcreteLog ;\n",
      "            dct:temporal [ a dct:PeriodOfTime ;\n",
      "                    logset:endDate \"2017-09-07T00:01:31.068610-07:00\"^^xsd:dateTime ;\n",
      "                    logset:startDate \"2017-09-07T00:00:37.627889-07:00\"^^xsd:dateTime ] ;\n",
      "            dcat:downloadURL \"p0-20170906t151820/console-20170907\" ;\n",
      "            dcat:mediaType \"text/plain\" ;\n",
      "            logset:isInstanceOf :console_logfile ],\n",
      "        [ a logset:ConcreteLog ;\n",
      "            dct:temporal [ a dct:PeriodOfTime ;\n",
      "                    logset:startDate \"2017-09-06T00:00:00\"^^xsd:dateTime ] ;\n",
      "            dcat:downloadURL \"p0-20170906t151820/consumer-20170906\" ;\n",
      "            dcat:mediaType \"text/plain\" ;\n",
      "            logset:isInstanceOf :consumer_logfile ],\n",
      "        [ a logset:ConcreteLog ;\n",
      "            dct:temporal [ a dct:PeriodOfTime ;\n",
      "                    logset:endDate \"2017-09-07T23:59:59-07:00\"^^xsd:dateTime ;\n",
      "                    logset:startDate \"2017-09-07T00:00:00-07:00\"^^xsd:dateTime ] ;\n",
      "            dcat:downloadURL \"p0-20170906t151820/consumer-20170907\" ;\n",
      "            dcat:mediaType \"text/plain\" ;\n",
      "            logset:isInstanceOf :consumer_logfile ],\n",
      "        [ a logset:ConcreteLog ;\n",
      "            dct:temporal [ a dct:PeriodOfTime ;\n",
      "                    logset:endDate \"2017-09-06T15:29:17.665618-07:00\"^^xsd:dateTime ;\n",
      "                    logset:startDate \"2017-09-06T15:26:39.977558-07:00\"^^xsd:dateTime ] ;\n",
      "            dcat:downloadURL \"p0-20170906t151820/messages-20170906\" ;\n",
      "            dcat:mediaType \"text/plain\" ;\n",
      "            logset:isInstanceOf :messages_logfile ],\n",
      "        [ a logset:ConcreteLog ;\n",
      "            dct:temporal [ a dct:PeriodOfTime ;\n",
      "                    logset:endDate \"2017-09-07T00:00:01.135482-07:00\"^^xsd:dateTime ;\n",
      "                    logset:startDate \"2017-09-07T00:00:01.008501-07:00\"^^xsd:dateTime ] ;\n",
      "            dcat:downloadURL \"p0-20170906t151820/messages-20170907\" ;\n",
      "            dcat:mediaType \"text/plain\" ;\n",
      "            logset:isInstanceOf :messages_logfile ] ;\n",
      "    logset:subject entities:cori .\n",
      "\n",
      ":annotationDB a logset:LogSeries ;\n",
      "    logset:logFormat :sqlite3 .\n",
      "\n",
      ":binaryFile a logset:LogFormatType .\n",
      "\n",
      ":filePerTimepoint a logset:LogFormatType .\n",
      "\n",
      ":unknownLogFormat a logset:LogFormatType .\n",
      "\n",
      "logset:affects a owl:ObjectProperty ;\n",
      "    rdfs:comment \"\"\" Components in an HPC center are not a strict hierarchy,\n",
      "                     eg a filesystem might be shared by multiple systems. \n",
      "                     So we connect related systems and subsystems with an \n",
      "                     \"affects\" relationship\n",
      "                 \"\"\" ;\n",
      "    rdfs:domain adms:Asset ;\n",
      "    rdfs:range adms:Asset .\n",
      "\n",
      "logset:assets a owl:ObjectProperty ;\n",
      "    rdfs:comment \"\"\" A single catalog has LogSets for certain assets, eg \n",
      "                     nersc-catalog will have logs for edison and cori, while \n",
      "                     snl-catalog will have logs for mutrino and trinity\n",
      "                 \"\"\" ;\n",
      "    rdfs:domain dcat:Catalog ;\n",
      "    rdfs:range adms:Asset .\n",
      "\n",
      "logset:endDate a owl:DatatypeProperty ;\n",
      "    rdfs:domain dct:PeriodOfTime ;\n",
      "    rdfs:range xsd:dateTime .\n",
      "\n",
      "logset:logFormatInfo a owl:DatatypeProperty ;\n",
      "    rdfs:comment \"\"\" dictionary-like information that a LogFormatType handler \n",
      "                     class can use to interpret a specific type of logfile. Each \n",
      "                     logFormatInfo property should be a literal like \n",
      "                     \"key=value\". Eg, a console_logfile and message_logfile are\n",
      "                     both timeStampedLogFile, but in the console log the \n",
      "                     timestamp is the first \"word\" on each line, while in the \n",
      "                     message log the timestamp is the second word on each line.\n",
      "                     So console_logfile can have recordInfoProperty \"ts_word=0\"\n",
      "                     (and \"part_word=1\" for system component) \n",
      "                 \"\"\" ;\n",
      "    rdfs:domain logset:LogSeries ;\n",
      "    rdfs:range rdfs:Literal .\n",
      "\n",
      "logset:peers a owl:ObjectProperty ;\n",
      "    rdfs:comment \"\"\" URIs for other catalogs, analagous to html links forming \n",
      "                     the www\n",
      "                 \"\"\" ;\n",
      "    rdfs:domain dcat:Catalog ;\n",
      "    rdfs:range dcat:Catalog .\n",
      "\n",
      "logset:startDate a owl:DatatypeProperty ;\n",
      "    rdfs:domain dct:PeriodOfTime ;\n",
      "    rdfs:range xsd:dateTime .\n",
      "\n",
      ":sqlite3 a logset:LogFormatType .\n",
      "\n",
      "logset:isInstanceOf a owl:FunctionalProperty,\n",
      "        owl:ObjectProperty ;\n",
      "    rdfs:comment \"Links a LogSeries to log data (eg a log file)\" ;\n",
      "    rdfs:domain logset:ConcreteLog ;\n",
      "    rdfs:range logset:LogSeries .\n",
      "\n",
      "logset:logFormat a owl:FunctionalProperty,\n",
      "        owl:ObjectProperty ;\n",
      "    rdfs:comment \"\"\" An entity indicating how a LogSeries is formatted, from \n",
      "                     which tools can decide how to process it.\n",
      "                     For example, most logs are timestamped-line-per-entry (in\n",
      "                     a file or stream) but some are a timestamped multiline \n",
      "                     block, others have a file per timestamp and contain a \n",
      "                     table, others hove no obvious structure at all. \n",
      "                     problem: what if the \n",
      "                     same log might be in a native file or as records in a \n",
      "                     database? then the logFormat should provide enough \n",
      "                     information for a tool to answer questions about it?\n",
      "                     or does that count as a different logseries?\n",
      "                 \"\"\" ;\n",
      "    rdfs:domain logset:LogSeries ;\n",
      "    rdfs:range logset:LogFormatType ;\n",
      "    owl:oneOf ( :timeStampedLogFile :unstructuredFile ) .\n",
      "\n",
      "logset:subject a owl:ObjectProperty ;\n",
      "    rdfs:comment \"\"\" A LogSet has logs about a specific system or component,\n",
      "                     and a LogSeries might be about a specific component \n",
      "                     within the system the LogSet documents \n",
      "                 \"\"\" ;\n",
      "    rdfs:domain [ owl:UnionOf ( logset:LogSet logset:LogSeries ) ] ;\n",
      "    rdfs:range adms:Asset .\n",
      "\n",
      ":console_logfile a logset:LogSeries ;\n",
      "    logset:logFormat :timeStampedLogFile ;\n",
      "    logset:logFormatInfo \"filepattern=console\",\n",
      "        \"filepattern=console-<dateYYYYMMDD>\",\n",
      "        \"part_word=1\",\n",
      "        \"ts_word=0\" .\n",
      "\n",
      ":consumer_logfile a logset:LogSeries ;\n",
      "    logset:logFormat :unstructuredFile ;\n",
      "    logset:logFormatInfo \"filepattern=consumer\",\n",
      "        \"filepattern=consumer-<dateYYYYMMDD>\" .\n",
      "\n",
      ":messages_logfile a logset:LogSeries ;\n",
      "    logset:logFormat :timeStampedLogFile ;\n",
      "    logset:logFormatInfo \"filepattern=messages\",\n",
      "        \"filepattern=messages-<dateYYYYMMDD>\",\n",
      "        \"part_word=2\",\n",
      "        \"ts_word=1\" .\n",
      "\n",
      ":unstructuredFile a logset:LogFormatType .\n",
      "\n",
      "logset:LogSet a owl:Class ;\n",
      "    rdfs:comment \"\"\" A LogSet is a Dataset for a specific system, spanning a \n",
      "                     specific timeframe (eg a Cray boot session on NERSC Cori). \n",
      "                     It is recommended but not enforced that a LogSet instance \n",
      "                     should have certain properties describing its provenance:   \n",
      "                     # dct:title         a rdfs:Literal\n",
      "                     # dct:description   a rdfs:Literal\n",
      "                     # dct:publisher     a foaf:Organization\n",
      "                     # dct:contactPoint  a vcard:Kind\n",
      "                     The actual files (or db queries etc) of the logs are \n",
      "                     described as a :ConcreteLog, based on dcat:Distribution\n",
      "                 \"\"\" ;\n",
      "    rdfs:subClassOf [ a owl:Restriction ;\n",
      "            owl:cardinality 1 ;\n",
      "            owl:onProperty dct:temporal ],\n",
      "        [ a owl:Restriction ;\n",
      "            owl:onProperty logset:subject ],\n",
      "        dcat:Dataset .\n",
      "\n",
      ":timeStampedLogFile a logset:LogFormatType .\n",
      "\n",
      "logset:ConcreteLog a owl:Class ;\n",
      "    rdfs:comment \"\"\" storage of a specific log, eg a File or database or web \n",
      "                     service, with knowledge of how to handle this type of \n",
      "                     log in this format. Eg, the actual files in a p0 package\n",
      "                     are ConcreteLog objects \n",
      "                 \"\"\" ;\n",
      "    rdfs:subClassOf [ a owl:Restriction ;\n",
      "            owl:cardinality 1 ;\n",
      "            owl:onProperty logset:isInstanceOf ],\n",
      "        dcat:Distribution .\n",
      "\n",
      "logset:LogFormatType a owl:Class ;\n",
      "    rdfs:comment \"\"\" An entity representing how log data is organized, in order \n",
      "                     to help tools decide how to handle a give log.  \n",
      "                     For example, most logs are timestamped-line-per-entry but\n",
      "                     some are a timestamped multiline block, others have a file\n",
      "                     per timestamp and contain a table, others hove no obvious \n",
      "                     structure at all. \n",
      "                     A LogFormatType is expected to correspond to a handler \n",
      "                     class for logs in that format\n",
      "                 \"\"\" .\n",
      "\n",
      "logset:LogSeries a owl:Class ;\n",
      "    rdfs:comment \"\"\" A \"type\" of logfile, eg a console or outage log. Can be \n",
      "                     used by tools to indicate how to handle a log. Must have\n",
      "                     a property indicating the \"canonical\" format that tools\n",
      "                     can assume on\n",
      "                     hmm: if we have multiple source for same type of log (eg \n",
      "                     version in elasticsearch), then maybe we need an \n",
      "                     \"equivalentTo\" property to link them?\n",
      "                 \"\"\" ;\n",
      "    rdfs:subClassOf [ a owl:Restriction ;\n",
      "            owl:cardinality 1 ;\n",
      "            owl:onProperty logset:logFormat ] .\n",
      "\n",
      "\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#sample_data'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/vocab#LogSet'))\n",
      "(rdflib.term.BNode('f0d0d389c2a184c2cb8a54c080f4a263db5'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/vocab#ConcreteLog'))\n",
      "(rdflib.term.BNode('ub45bL137C18'), rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/vocab#endDate'), rdflib.term.Literal('2017-09-07T00:00:01.135482-07:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.BNode('ub45bL47C18'), rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/vocab#startDate'), rdflib.term.Literal('2017-09-06T15:18:20.827169-07:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.BNode('f0d0d389c2a184c2cb8a54c080f4a263db5'), rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/vocab#isInstanceOf'), rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/dict#messages_logfile'))\n",
      "(rdflib.term.BNode('ub45bL47C18'), rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/vocab#endDate'), rdflib.term.Literal('2017-09-07T15:22:42.809617-07:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.BNode('f0d0d389c2a184c2cb8a54c080f4a263db4'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/vocab#ConcreteLog'))\n",
      "(rdflib.term.BNode('ub45bL99C18'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://purl.org/dc/terms/PeriodOfTime'))\n",
      "(rdflib.term.BNode('f0d0d389c2a184c2cb8a54c080f4a263db4'), rdflib.term.URIRef('http://purl.org/dc/terms/temporal'), rdflib.term.BNode('ub45bL111C18'))\n",
      "(rdflib.term.BNode('f0d0d389c2a184c2cb8a54c080f4a263db6'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/vocab#ConcreteLog'))\n",
      "(rdflib.term.BNode('f0d0d389c2a184c2cb8a54c080f4a263db1'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/vocab#ConcreteLog'))\n",
      "(rdflib.term.BNode('f0d0d389c2a184c2cb8a54c080f4a263db1'), rdflib.term.URIRef('http://purl.org/dc/terms/temporal'), rdflib.term.BNode('ub45bL69C18'))\n",
      "(rdflib.term.BNode('f0d0d389c2a184c2cb8a54c080f4a263db3'), rdflib.term.URIRef('http://purl.org/dc/terms/temporal'), rdflib.term.BNode('ub45bL99C18'))\n",
      "(rdflib.term.BNode('ub45bL99C18'), rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/vocab#startDate'), rdflib.term.Literal('2017-09-06T00:00:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#sample_data'), rdflib.term.URIRef('http://www.w3.org/ns/dcat#distribution'), rdflib.term.BNode('f0d0d389c2a184c2cb8a54c080f4a263db2'))\n",
      "(rdflib.term.BNode('ub45bL69C18'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://purl.org/dc/terms/PeriodOfTime'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#sample_data'), rdflib.term.URIRef('http://www.w3.org/ns/dcat#distribution'), rdflib.term.BNode('f0d0d389c2a184c2cb8a54c080f4a263db6'))\n",
      "(rdflib.term.BNode('ub45bL111C18'), rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/vocab#endDate'), rdflib.term.Literal('2017-09-07T23:59:59-07:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.BNode('f0d0d389c2a184c2cb8a54c080f4a263db2'), rdflib.term.URIRef('http://www.w3.org/ns/dcat#mediaType'), rdflib.term.Literal('text/plain'))\n",
      "(rdflib.term.BNode('ub45bL85C18'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://purl.org/dc/terms/PeriodOfTime'))\n",
      "(rdflib.term.BNode('ub45bL137C18'), rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/vocab#startDate'), rdflib.term.Literal('2017-09-07T00:00:01.008501-07:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.BNode('ub45bL69C18'), rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/vocab#endDate'), rdflib.term.Literal('2017-09-06T15:22:42.809617-07:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.BNode('f0d0d389c2a184c2cb8a54c080f4a263db4'), rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/vocab#isInstanceOf'), rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/dict#consumer_logfile'))\n",
      "(rdflib.term.BNode('f0d0d389c2a184c2cb8a54c080f4a263db1'), rdflib.term.URIRef('http://www.w3.org/ns/dcat#mediaType'), rdflib.term.Literal('text/plain'))\n",
      "(rdflib.term.BNode('ub45bL111C18'), rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/vocab#startDate'), rdflib.term.Literal('2017-09-07T00:00:00-07:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.BNode('f0d0d389c2a184c2cb8a54c080f4a263db3'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/vocab#ConcreteLog'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#sample_data'), rdflib.term.URIRef('http://www.w3.org/ns/dcat#distribution'), rdflib.term.BNode('f0d0d389c2a184c2cb8a54c080f4a263db3'))\n",
      "(rdflib.term.BNode('ub45bL69C18'), rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/vocab#startDate'), rdflib.term.Literal('2017-09-06T15:20:21.827169-07:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#sample_data'), rdflib.term.URIRef('http://purl.org/dc/terms/description'), rdflib.term.Literal('a partial sample of cori log data for testing logset tools'))\n",
      "(rdflib.term.BNode('f0d0d389c2a184c2cb8a54c080f4a263db3'), rdflib.term.URIRef('http://www.w3.org/ns/dcat#downloadURL'), rdflib.term.Literal('p0-20170906t151820/consumer-20170906'))\n",
      "(rdflib.term.BNode('f0d0d389c2a184c2cb8a54c080f4a263db6'), rdflib.term.URIRef('http://www.w3.org/ns/dcat#mediaType'), rdflib.term.Literal('text/plain'))\n",
      "(rdflib.term.BNode('f0d0d389c2a184c2cb8a54c080f4a263db3'), rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/vocab#isInstanceOf'), rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/dict#consumer_logfile'))\n",
      "(rdflib.term.BNode('f0d0d389c2a184c2cb8a54c080f4a263db4'), rdflib.term.URIRef('http://www.w3.org/ns/dcat#mediaType'), rdflib.term.Literal('text/plain'))\n",
      "(rdflib.term.BNode('f0d0d389c2a184c2cb8a54c080f4a263db2'), rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/vocab#isInstanceOf'), rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/dict#console_logfile'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#sample_data'), rdflib.term.URIRef('http://www.w3.org/ns/dcat#distribution'), rdflib.term.BNode('f0d0d389c2a184c2cb8a54c080f4a263db4'))\n",
      "(rdflib.term.BNode('f0d0d389c2a184c2cb8a54c080f4a263db1'), rdflib.term.URIRef('http://www.w3.org/ns/dcat#downloadURL'), rdflib.term.Literal('p0-20170906t151820/console-20170906'))\n",
      "(rdflib.term.BNode('ub45bL47C18'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://purl.org/dc/terms/PeriodOfTime'))\n",
      "(rdflib.term.BNode('f0d0d389c2a184c2cb8a54c080f4a263db5'), rdflib.term.URIRef('http://www.w3.org/ns/dcat#downloadURL'), rdflib.term.Literal('p0-20170906t151820/messages-20170906'))\n",
      "(rdflib.term.BNode('f0d0d389c2a184c2cb8a54c080f4a263db5'), rdflib.term.URIRef('http://www.w3.org/ns/dcat#mediaType'), rdflib.term.Literal('text/plain'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#sample_data'), rdflib.term.URIRef('http://www.w3.org/ns/dcat#distribution'), rdflib.term.BNode('f0d0d389c2a184c2cb8a54c080f4a263db1'))\n",
      "(rdflib.term.BNode('ub45bL111C18'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://purl.org/dc/terms/PeriodOfTime'))\n",
      "(rdflib.term.BNode('f0d0d389c2a184c2cb8a54c080f4a263db2'), rdflib.term.URIRef('http://www.w3.org/ns/dcat#downloadURL'), rdflib.term.Literal('p0-20170906t151820/console-20170907'))\n",
      "(rdflib.term.BNode('f0d0d389c2a184c2cb8a54c080f4a263db4'), rdflib.term.URIRef('http://www.w3.org/ns/dcat#downloadURL'), rdflib.term.Literal('p0-20170906t151820/consumer-20170907'))\n",
      "(rdflib.term.BNode('f0d0d389c2a184c2cb8a54c080f4a263db5'), rdflib.term.URIRef('http://purl.org/dc/terms/temporal'), rdflib.term.BNode('ub45bL124C18'))\n",
      "(rdflib.term.BNode('f0d0d389c2a184c2cb8a54c080f4a263db2'), rdflib.term.URIRef('http://purl.org/dc/terms/temporal'), rdflib.term.BNode('ub45bL85C18'))\n",
      "(rdflib.term.BNode('ub45bL124C18'), rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/vocab#endDate'), rdflib.term.Literal('2017-09-06T15:29:17.665618-07:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#sample_data'), rdflib.term.URIRef('http://www.w3.org/ns/dcat#distribution'), rdflib.term.BNode('f0d0d389c2a184c2cb8a54c080f4a263db5'))\n",
      "(rdflib.term.BNode('ub45bL85C18'), rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/vocab#endDate'), rdflib.term.Literal('2017-09-07T00:01:31.068610-07:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.BNode('ub45bL137C18'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://purl.org/dc/terms/PeriodOfTime'))\n",
      "(rdflib.term.BNode('f0d0d389c2a184c2cb8a54c080f4a263db6'), rdflib.term.URIRef('http://www.w3.org/ns/dcat#downloadURL'), rdflib.term.Literal('p0-20170906t151820/messages-20170907'))\n",
      "(rdflib.term.BNode('f0d0d389c2a184c2cb8a54c080f4a263db1'), rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/vocab#isInstanceOf'), rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/dict#console_logfile'))\n",
      "(rdflib.term.BNode('f0d0d389c2a184c2cb8a54c080f4a263db2'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/vocab#ConcreteLog'))\n",
      "(rdflib.term.BNode('f0d0d389c2a184c2cb8a54c080f4a263db6'), rdflib.term.URIRef('http://purl.org/dc/terms/temporal'), rdflib.term.BNode('ub45bL137C18'))\n",
      "(rdflib.term.BNode('f0d0d389c2a184c2cb8a54c080f4a263db3'), rdflib.term.URIRef('http://www.w3.org/ns/dcat#mediaType'), rdflib.term.Literal('text/plain'))\n",
      "(rdflib.term.BNode('ub45bL124C18'), rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/vocab#startDate'), rdflib.term.Literal('2017-09-06T15:26:39.977558-07:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.BNode('ub45bL85C18'), rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/vocab#startDate'), rdflib.term.Literal('2017-09-07T00:00:37.627889-07:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#sample_data'), rdflib.term.URIRef('http://purl.org/dc/terms/temporal'), rdflib.term.BNode('ub45bL47C18'))\n",
      "(rdflib.term.BNode('ub45bL124C18'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://purl.org/dc/terms/PeriodOfTime'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#sample_data'), rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/vocab#subject'), rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/nersc-entities#cori'))\n",
      "(rdflib.term.BNode('f0d0d389c2a184c2cb8a54c080f4a263db6'), rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/vocab#isInstanceOf'), rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/dict#messages_logfile'))\n"
     ]
    }
   ],
   "source": [
    "gindex = rdflib.ConjunctiveGraph().parse('{0:s}/examples/index.ttl'.format(root), format='turtle')\n",
    "#graph.parse('{0:s}/examples/index.ttl'.format(root), format='turtle')\n",
    "graph = (gvocab + gdict) + gindex\n",
    "print(graph.serialize(format='n3').decode('ascii'))\n",
    "#for s,p,o in graph:\n",
    "for s,p,o in gindex:    \n",
    "    print ((s,p,o))\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(rdflib.term.BNode('fea6ff145e3234ce499ffafdbc24c65c9b1'), rdflib.term.Literal('a partial sample of cori log data for testing logset tools'))\n"
     ]
    }
   ],
   "source": [
    "query = '''SELECT ?id ?desc\n",
    "WHERE {\n",
    "?id a logset:LogSet .\n",
    "?id dct:description ?desc .\n",
    "}'''\n",
    "#print(query[21])\n",
    "for row in graph.query(query):\n",
    "    print(row)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "quering the whole graph:\n",
      "querying only gindex:\n"
     ]
    }
   ],
   "source": [
    "query = '''SELECT ?id ?path\n",
    "WHERE {\n",
    "?id logset:isLogOf dict:console_logfile .\n",
    "?id logset:path ?path .\n",
    "} '''\n",
    "print(\"quering the whole graph:\")\n",
    "for row in graph.query(query):\n",
    "    print(row)\n",
    "    \n",
    "# if I don't explicitly include the logset.ttl in the graph:\n",
    "print(\"querying only gindex:\")\n",
    "# (oh - actually everything needed is in the index.ttl)\n",
    "for row in gindex.query(query):\n",
    "    print(row)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "with full graph:\n",
      "(rdflib.term.BNode('fea6ff145e3234ce499ffafdbc24c65c9b4'), None)\n",
      "(rdflib.term.BNode('fea6ff145e3234ce499ffafdbc24c65c9b2'), None)\n",
      "(rdflib.term.BNode('fea6ff145e3234ce499ffafdbc24c65c9b6'), None)\n",
      "(rdflib.term.BNode('fea6ff145e3234ce499ffafdbc24c65c9b5'), None)\n",
      "(rdflib.term.BNode('fea6ff145e3234ce499ffafdbc24c65c9b3'), None)\n",
      "(rdflib.term.BNode('fea6ff145e3234ce499ffafdbc24c65c9b7'), None)\n",
      "with gindex only:\n"
     ]
    }
   ],
   "source": [
    "query = '''SELECT ?id ?path\n",
    "WHERE {\n",
    "?id a ?type .\n",
    "?type rdfs:subClassOf* logset:ConcreteLog . \n",
    "OPTIONAL { ?id logset:path ?path }\n",
    "} '''\n",
    "query = '''SELECT ?id ?path\n",
    "WHERE {\n",
    "?id a ?type .\n",
    "?type rdfs:subClassOf* dcat:Distribution . \n",
    "OPTIONAL { ?id logset:path ?path }\n",
    "} '''\n",
    "# :ConcreteLog is defined in vocab.ttl .. so if our graph includes that (local file) we get:\n",
    "print (\"with full graph:\")\n",
    "for row in graph.query(query):\n",
    "    print(row)\n",
    "    \n",
    "# on the other hand, if we only query the local gindex graph:\n",
    "print (\"with gindex only:\")\n",
    "for row in gindex.query(query):\n",
    "    print(row)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "https://raw.githubusercontent.com/NERSC/LogSet/master/etc/vocab#\n",
      "('xml', rdflib.term.URIRef('http://www.w3.org/XML/1998/namespace'))\n",
      "('rdf', rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#'))\n",
      "('rdfs', rdflib.term.URIRef('http://www.w3.org/2000/01/rdf-schema#'))\n",
      "('xsd', rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#'))\n",
      "('logset', rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/vocab#'))\n",
      "('dict', rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/etc/dict#'))\n",
      "('entities', rdflib.term.URIRef('http://portal.nersc.gov/project/m888/resilience/entities#'))\n",
      "('dct', rdflib.term.URIRef('http://purl.org/dc/terms/'))\n",
      "('dcat', rdflib.term.URIRef('http://www.w3.org/ns/dcat#'))\n",
      "g now has 60 statements\n",
      "<https://raw.githubusercontent.com/NERSC/LogSet/master/etc/vocab#>\n",
      "https://raw.githubusercontent.com/NERSC/LogSet/master/etc/vocab\n",
      "g now has 118 statements\n",
      "<file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/etc/dict#>\n",
      "file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/etc/dict\n",
      "g now has 147 statements\n",
      "(rdflib.term.BNode('fc73e74a9cc444f1995bdf87b27e06470b3'), None)\n",
      "(rdflib.term.BNode('fc73e74a9cc444f1995bdf87b27e06470b2'), None)\n",
      "(rdflib.term.BNode('fc73e74a9cc444f1995bdf87b27e06470b5'), None)\n",
      "(rdflib.term.BNode('fc73e74a9cc444f1995bdf87b27e06470b7'), None)\n",
      "(rdflib.term.BNode('fc73e74a9cc444f1995bdf87b27e06470b4'), None)\n",
      "(rdflib.term.BNode('fc73e74a9cc444f1995bdf87b27e06470b6'), None)\n"
     ]
    }
   ],
   "source": [
    "# so to assemble the full graph, I need to explicitly parse the vocab and data dictionary:\n",
    "# (mostly useful for catalog, as it will find subgraphs from there)\n",
    "\n",
    "# can i parse a remote graph at all?\n",
    "#g1 = rdflib.Graph().parse('https://www.w3.org/ns/dcat.ttl')\n",
    "#print (g1)\n",
    "# yes! but providing a format might be necessary\n",
    "#gg = rdflib.Graph().parse('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/vocab.ttl', format='turtle')\n",
    "gindex = rdflib.ConjunctiveGraph().parse('{0:s}/examples/index.ttl'.format(root), format='turtle')\n",
    "##for s,p,o in gindex:    \n",
    "##    print ((s,p,o))\n",
    "namespaces=dict([n for n in gindex.namespaces()])\n",
    "print(namespaces['logset'])\n",
    "for n in gindex.namespaces():\n",
    "    print (n)\n",
    "#print(dir(rdflib.term.URIRef))\n",
    "#print(rdflib.term.URIRef.__class__)\n",
    "g = gindex\n",
    "print (\"g now has {0} statements\".format(len(g)))\n",
    "for uri in [n[1] for n in gindex.namespaces() if n[0] in ('logset','dict')]:\n",
    "    print(str(uri.n3()))\n",
    "    print(str(uri)[:-1])\n",
    "    gsource=str(uri)[:-1] + '.ttl'   # needs extension or 404!\n",
    "    g += rdflib.ConjunctiveGraph().parse(gsource, format='turtle')\n",
    "    print (\"g now has {0} statements\".format(len(g)))\n",
    "    #summary = g.serialize(format='n3').decode('ascii')\n",
    "    #print(summary.splitlines()[:10])\n",
    "    #print(g.serialize(format='n3').decode('ascii'))\n",
    "\n",
    "# now what if I run that same query:\n",
    "query = '''SELECT ?id ?path\n",
    "WHERE {\n",
    "?id a ?type .\n",
    "?type rdfs:subClassOf* dcat:Distribution . \n",
    "OPTIONAL { ?id logset:path ?path }\n",
    "} '''\n",
    "for row in g.query(query):\n",
    "    print(row)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(rdflib.term.BNode('f7e73b117255e47d792494d6388bac5afb2'), rdflib.term.Literal('p0-20170906t151820/console-20170906'), rdflib.term.BNode('ub15bL65C18'))\n",
      "(rdflib.term.BNode('f7e73b117255e47d792494d6388bac5afb6'), rdflib.term.Literal('p0-20170906t151820/messages-20170906'), rdflib.term.BNode('ub15bL120C18'))\n",
      "(rdflib.term.BNode('f7e73b117255e47d792494d6388bac5afb7'), rdflib.term.Literal('p0-20170906t151820/messages-20170907'), rdflib.term.BNode('ub15bL133C18'))\n",
      "(rdflib.term.BNode('f7e73b117255e47d792494d6388bac5afb5'), rdflib.term.Literal('p0-20170906t151820/consumer-20170907'), rdflib.term.BNode('ub15bL107C18'))\n",
      "(rdflib.term.BNode('f7e73b117255e47d792494d6388bac5afb4'), rdflib.term.Literal('p0-20170906t151820/consumer-20170906'), rdflib.term.BNode('ub15bL95C18'))\n",
      "(rdflib.term.BNode('f7e73b117255e47d792494d6388bac5afb3'), rdflib.term.Literal('p0-20170906t151820/console-20170907'), rdflib.term.BNode('ub15bL81C18'))\n"
     ]
    }
   ],
   "source": [
    "query = '''SELECT ?id ?path\n",
    "WHERE {\n",
    "?id logset:isLogOf dict:console_logfile .\n",
    "?id logset:path ?path .\n",
    "} '''\n",
    "# now we can find the datasources in the loaded graph\n",
    "query2 = '''SELECT ?id ?path ?time\n",
    "WHERE {\n",
    "?id a ?type .\n",
    "?type rdfs:subClassOf* logset:ConcreteLog . \n",
    "?id dct:temporal ?time .\n",
    "OPTIONAL { ?id dcat:downloadURL ?path }\n",
    "} '''\n",
    "#query3 = '''SELECT ?id ?type ?base\n",
    "#WHERE {\n",
    "#?id a ?type .\n",
    "#OPTIONAL { ?type rdfs:subClassOf ?base }\n",
    "#}'''\n",
    "for row in g.query(query2):\n",
    "    print(row)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(rdflib.term.BNode('f1454b393d3b34d8fbf97b594baecf658b5'), rdflib.term.Literal('p0-20170906t151820/consumer-20170907'))\n",
      "(rdflib.term.BNode('f1454b393d3b34d8fbf97b594baecf658b4'), rdflib.term.Literal('p0-20170906t151820/consumer-20170906'))\n",
      "(rdflib.term.BNode('f1454b393d3b34d8fbf97b594baecf658b6'), rdflib.term.Literal('p0-20170906t151820/messages-20170906'))\n",
      "(rdflib.term.BNode('f1454b393d3b34d8fbf97b594baecf658b7'), rdflib.term.Literal('p0-20170906t151820/messages-20170907'))\n",
      "(rdflib.term.BNode('f1454b393d3b34d8fbf97b594baecf658b2'), rdflib.term.Literal('p0-20170906t151820/console-20170906'))\n",
      "(rdflib.term.BNode('f1454b393d3b34d8fbf97b594baecf658b3'), rdflib.term.Literal('p0-20170906t151820/console-20170907'))\n"
     ]
    }
   ],
   "source": [
    "query = '''SELECT ?id ?path\n",
    "WHERE {\n",
    "?id logset:isInstanceOf [ dict:console_logfile . \n",
    "?id dcat:downloadURL ?path .\n",
    "} '''\n",
    "query = '''SELECT ?id\n",
    "WHERE {\n",
    "?id a logset:LogSeries .\n",
    "}\n",
    "'''\n",
    "query = '''SELECT ?id ?path\n",
    "WHERE {\n",
    "?id logset:isInstanceOf [a logset:LogSeries] .\n",
    "?id dcat:downloadURL ?path .\n",
    "}\n",
    "'''\n",
    "for row in g.query(query):\n",
    "    print(row)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/dict#consumer_logfile'), rdflib.term.Literal('filepattern=consumer'))\n",
      "(rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/dict#consumer_logfile'), rdflib.term.Literal('filepattern=consumer-<dateYYYYMMDD>'))\n",
      "(rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/dict#messages_logfile'), rdflib.term.Literal('filepattern=messages'))\n",
      "(rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/dict#messages_logfile'), rdflib.term.Literal('ts_word=1'))\n",
      "(rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/dict#messages_logfile'), rdflib.term.Literal('filepattern=messages-<dateYYYYMMDD>'))\n",
      "(rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/dict#messages_logfile'), rdflib.term.Literal('part_word=2'))\n",
      "(rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/dict#console_logfile'), rdflib.term.Literal('filepattern=console'))\n",
      "(rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/dict#console_logfile'), rdflib.term.Literal('part_word=1'))\n",
      "(rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/dict#console_logfile'), rdflib.term.Literal('ts_word=0'))\n",
      "(rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/dict#console_logfile'), rdflib.term.Literal('filepattern=console-<dateYYYYMMDD>'))\n"
     ]
    }
   ],
   "source": [
    "query = '''SELECT ?series ?filepattern\n",
    "WHERE {\n",
    "?series a logset:LogSeries .\n",
    "?series logset:logFormatInfo ?filepattern .\n",
    "}\n",
    "'''\n",
    "for row in g.query(query):\n",
    "    print(row)\n",
    "# it seems graphs don't do regex filtering of literals well, so best is \n",
    "# to collect the logFormatInfos for each series, build a dictionary of \n",
    "# lists-of-values, and work with that"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(rdflib.term.BNode('f1454b393d3b34d8fbf97b594baecf658b5'), rdflib.term.Literal('p0-20170906t151820/consumer-20170907'), rdflib.term.Literal('2017-09-07T00:00:00-07:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.BNode('f1454b393d3b34d8fbf97b594baecf658b7'), rdflib.term.Literal('p0-20170906t151820/messages-20170907'), rdflib.term.Literal('2017-09-07T00:00:01.008501-07:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.BNode('f1454b393d3b34d8fbf97b594baecf658b3'), rdflib.term.Literal('p0-20170906t151820/console-20170907'), rdflib.term.Literal('2017-09-07T00:00:37.627889-07:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n"
     ]
    }
   ],
   "source": [
    "# next: querying on datetime fields:\n",
    "query = '''SELECT ?id ?path ?start\n",
    "WHERE {\n",
    "?id logset:isInstanceOf [a logset:LogSeries] .\n",
    "?id dcat:downloadURL ?path .\n",
    "?id dct:temporal/logset:startDate ?start .\n",
    "FILTER (?start >= \"2017-09-07-07:00\"^^xsd:dateTime)\n",
    "}\n",
    "'''\n",
    "# FILTER (?time = \"2017-09-07\"^^xsd:dateTime)\n",
    "# this doesn't work:\n",
    "# ?id dct:temporal [a dct:PeriodOfTime ; logset:startDate ?start ; OPTIONAL { logset:endDate ?end } ] .\n",
    "for row in g.query(query):\n",
    "    print(row)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "ename": "NameError",
     "evalue": "name '__version__' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mNameError\u001b[0m                                 Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-12-d0ad0054b387>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m()\u001b[0m\n\u001b[0;32m----> 1\u001b[0;31m \u001b[0m__version__\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m",
      "\u001b[0;31mNameError\u001b[0m: name '__version__' is not defined"
     ]
    }
   ],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python [default]",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
