{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "/global/u1/s/sleak/Monitoring/Resilience/LogSet/etc/logset.ttl\n",
      "/global/u1/s/sleak/Monitoring/Resilience/LogSet/etc/dict.ttl\n"
     ]
    }
   ],
   "source": [
    "import os\n",
    "root = os.getcwd().rsplit('/',1)[0]\n",
    "vocab_path = '{0:s}/etc/logset.ttl'.format(root)\n",
    "dict_path = '{0:s}/etc/dict.ttl'.format(root)\n",
    "print(vocab_path)\n",
    "print(dict_path)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "@prefix : <http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/dict#> .\n",
      "@prefix dcat: <http://www.w3.org/ns/dcat#> .\n",
      "@prefix dct: <http://purl.org/dc/terms/> .\n",
      "@prefix default1: <http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#> .\n",
      "@prefix logset: <http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#> .\n",
      "@prefix owl: <http://www.w3.org/2002/07/owl#> .\n",
      "@prefix rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .\n",
      "@prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#> .\n",
      "@prefix skos: <http://www.w3.org/2004/02/skos/core#> .\n",
      "@prefix xml: <http://www.w3.org/XML/1998/namespace> .\n",
      "@prefix xsd: <http://www.w3.org/2001/XMLSchema#> .\n",
      "\n",
      ":annotationDB a logset:LogSeries ;\n",
      "    logset:logFormat :sqlite3 .\n",
      "\n",
      ":annotations a logset:InfoType .\n",
      "\n",
      ":binaryFile a logset:LogFormatType ;\n",
      "    dcat:mediaType \"application/octet-stream\" .\n",
      "\n",
      ":dateYYYYMMDD a logset:FilenamePattern ;\n",
      "    logset:regex \"(?P<date>(?P<year>20[0-9]{2})(?P<month>0[1-9]|1[0-2])(?P<day>[0-3][0-9]))\" ;\n",
      "    logset:tag \"<date:YYYYMMDD>\" .\n",
      "\n",
      ":filePerTimepoint a logset:LogFormatType ;\n",
      "    dcat:mediaType \"inode/directory\" .\n",
      "\n",
      ":job_records a logset:InfoType .\n",
      "\n",
      ":localCommands a logset:LogFormatType ;\n",
      "    dcat:mediaType \"application/x-executable\" .\n",
      "\n",
      ":log_messages a logset:InfoType .\n",
      "\n",
      ":newtAPI a logset:LogFormatType ;\n",
      "    dcat:mediaType \"application/json\" .\n",
      "\n",
      ":system a logset:FilenamePattern ;\n",
      "    logset:regex \"(?P<system>[a-z][a-z0-9]+)\" ;\n",
      "    logset:tag \"<system:>\" .\n",
      "\n",
      ":timeStampedLogFile a logset:LogFormatType ;\n",
      "    dcat:mediaType \"text/plain\" .\n",
      "\n",
      ":timeYYYYMMDDHHmmss a logset:FilenamePattern ;\n",
      "    logset:regex \"(?P<time>(?P<year>20[0-9]{2})(?P<month>0[1-9]|1[0-2])(?P<day>[0-3][0-9])(?P<hour>[01][0-9]|2[0-3])(?P<minute>[0-5][0-9])(?P<second>[0-5][0-9]))\" ;\n",
      "    logset:tag \"<time:YYYYMMDDHHmmss>\" .\n",
      "\n",
      ":timeYYYYMMDDtHHmmss a logset:FilenamePattern ;\n",
      "    logset:regex \"(?P<time>(?P<year>20[0-9]{2})(?P<month>0[1-9]|1[0-2])(?P<day>[0-3][0-9])t(?P<hour>[01][0-9]|2[0-3])(?P<minute>[0-5][0-9])(?P<second>[0-5][0-9]))\" ;\n",
      "    logset:tag \"<time:YYYYMMDDtHHmmss>\" .\n",
      "\n",
      ":unstructuredTextFile a logset:LogFormatType ;\n",
      "    dcat:mediaType \"text/plain\" .\n",
      "\n",
      "logset: a owl:Ontology ;\n",
      "    rdfs:label \"LogSet\" ;\n",
      "    dct:title \"the LogSet vocabulary\" .\n",
      "\n",
      "logset:LogSet a owl:Class ;\n",
      "    rdfs:comment \"\"\" A LogSet is a dcat:Dataset of related logs (eg, the logs \n",
      "                     from a Cray boot session on NERSC Cori - related in system\n",
      "                     and access and timespan)\n",
      "                     It is recommended but not enforced that a LogSet instance \n",
      "                     should have certain properties describing its provenance:   \n",
      "                     # dct:title         a rdfs:Literal\n",
      "                     # dct:description   a rdfs:Literal\n",
      "                     # dct:publisher     a foaf:Organization\n",
      "                     # dct:contactPoint  a vcard:Kind\n",
      "                     (publisher and contactPoint are especially useful when the\n",
      "                     actual log data is not directly accessible to people or \n",
      "                     tools using the metadata, so that having identified that \n",
      "                     data exists, they can contact someone to request access).\n",
      "                     The actual files (or db queries etc) of the logs are \n",
      "                     described as a :ConcreteLog, based on dcat:Distribution.\n",
      "                     A LogSet is epected to be defined in its own index file\n",
      "                     and included in a dcat:Catalog\n",
      "                 \"\"\" ;\n",
      "    rdfs:subClassOf dcat:Dataset .\n",
      "\n",
      "logset:affects a owl:ObjectProperty ;\n",
      "    rdfs:comment \"\"\" Components in an HPC center are not a strict hierarchy,\n",
      "                     eg a filesystem might be shared by multiple systems. \n",
      "                     So we connect related systems and subsystems with an \n",
      "                     \"affects\" relationship\n",
      "                 \"\"\" ;\n",
      "    rdfs:domain logset:Subject ;\n",
      "    rdfs:range logset:Subject .\n",
      "\n",
      "logset:endDate a owl:DatatypeProperty ;\n",
      "    rdfs:domain dct:PeriodOfTime ;\n",
      "    rdfs:range xsd:dateTime .\n",
      "\n",
      "logset:estRecordCount a owl:DatatypeProperty ;\n",
      "    rdfs:comment \"\"\" an estimate of the number of records in a ConcreteLog,\n",
      "                     if that is guessable/appropriate\n",
      "                 \"\"\" ;\n",
      "    rdfs:domain logset:ConcreteLog ;\n",
      "    rdfs:range xsd:integer .\n",
      "\n",
      "logset:logFormatInfo a owl:DatatypeProperty ;\n",
      "    rdfs:comment \"\"\" dictionary-like information that a LogFormatType handler \n",
      "                     class can use to interpret a specific type of logfile. Each \n",
      "                     logFormatInfo property should be a literal like \n",
      "                     \"key=value\". Eg, a console_logfile and message_logfile are\n",
      "                     both timeStampedLogFile, but in the console log the \n",
      "                     timestamp is the first \"word\" on each line, while in the \n",
      "                     message log the timestamp is the second word on each line.\n",
      "                     So console_logfile can have recordInfoProperty \"ts_word=0\"\n",
      "                     (and \"part_word=1\" for system component) \n",
      "                 \"\"\" ;\n",
      "    rdfs:domain logset:LogSeries ;\n",
      "    rdfs:range rdfs:Literal .\n",
      "\n",
      "logset:recordCount a owl:DatatypeProperty ;\n",
      "    rdfs:domain logset:ConcreteLog ;\n",
      "    rdfs:range xsd:integer .\n",
      "\n",
      "logset:regex a owl:DatatypeProperty ;\n",
      "    rdfs:domain logset:FilenamePattern ;\n",
      "    rdfs:range rdfs:Literal .\n",
      "\n",
      "logset:specificSubjectPattern a owl:DatatypeProperty ;\n",
      "    rdfs:comment \"\"\" While major system components are represented by a Subject,\n",
      "                     representing specific smaller components (such as compute nodes\n",
      "                     or hsn links) is impractical. To indicate that a log (or LogSet)\n",
      "                     is about eg a specific node, or a subset of links, this literal \n",
      "                     label can be added\n",
      "                 \"\"\" ;\n",
      "    rdfs:domain logset:ConcreteLog ;\n",
      "    rdfs:range rdfs:Literal .\n",
      "\n",
      "logset:startDate a owl:DatatypeProperty ;\n",
      "    rdfs:domain dct:PeriodOfTime ;\n",
      "    rdfs:range xsd:dateTime .\n",
      "\n",
      "logset:tag a owl:DatatypeProperty ;\n",
      "    rdfs:domain logset:FilenamePattern ;\n",
      "    rdfs:range rdfs:Literal .\n",
      "\n",
      ":sqlite3 a logset:LogFormatType ;\n",
      "    dcat:mediaType \"application/x-sqlite3\" .\n",
      "\n",
      "logset:infoType a owl:FunctionalProperty,\n",
      "        owl:ObjectProperty ;\n",
      "    rdfs:comment \"\"\" the InfoType for this LogSeries\n",
      "                 \"\"\" ;\n",
      "    rdfs:domain logset:LogSeries ;\n",
      "    rdfs:range logset:InfoType .\n",
      "\n",
      "logset:isInstanceOf a owl:FunctionalProperty,\n",
      "        owl:ObjectProperty ;\n",
      "    rdfs:comment \"Links a LogSeries to log data (eg a log file)\" ;\n",
      "    rdfs:domain logset:ConcreteLog ;\n",
      "    rdfs:range logset:LogSeries .\n",
      "\n",
      "logset:logFormatType a owl:FunctionalProperty,\n",
      "        owl:ObjectProperty ;\n",
      "    rdfs:comment \"\"\" the LogFormatType for this LogSeries\n",
      "                 \"\"\" ;\n",
      "    rdfs:domain logset:LogSeries ;\n",
      "    rdfs:range logset:LogFormatType .\n",
      "\n",
      "logset:subject a owl:ObjectProperty ;\n",
      "    rdfs:comment \"\"\" The Asset whose state this LogSet or ConcreteLog describes.\n",
      "                     (eg a console-log might be for nersc:edison)\n",
      "                 \"\"\" ;\n",
      "    rdfs:domain logset:ConcreteLog ;\n",
      "    rdfs:range logset:Subject .\n",
      "\n",
      "logset:Subject a owl:Class ;\n",
      "    rdfs:comment \"\"\" A thing that a ConcreteLog is about, eg a system or \n",
      "                     subsystem, or even a specific job \n",
      "                 \"\"\" ;\n",
      "    rdfs:subClassOf skos:Concept .\n",
      "\n",
      "logset:InfoType a owl:Class ;\n",
      "    rdfs:comment \"\"\" What the entries in a LogSeries are, eg \"log_messages\"\n",
      "                     or \"job_records\". As an skos:Concept, InfoTypes can be \n",
      "                     linked as skos:narrower/broader/related\n",
      "                 \"\"\" ;\n",
      "    rdfs:subClassOf skos:Concept .\n",
      "\n",
      "logset:ConcreteLog a owl:Class ;\n",
      "    rdfs:label \"ConcreteLog\" ;\n",
      "    rdfs:comment \"\"\" An actual, specific log, eg a File or database or web \n",
      "                     service, with knowledge of how to handle this type of \n",
      "                     log in this format. Eg, the actual files in a p0 package\n",
      "                     are ConcreteLog objects.\n",
      "                     Should have either a dcat:downloadURL or a dcat:accessURL.\n",
      "                     May have a logset:subject (assumed from LogSet if not) and\n",
      "                     a logset:specificSubjectLabel\n",
      "                 \"\"\" ;\n",
      "    rdfs:subClassOf [ a owl:Restriction ;\n",
      "            owl:cardinality 1 ;\n",
      "            owl:onProperty logset:isInstanceOf ],\n",
      "        [ a owl:Restriction ;\n",
      "            owl:cardinality 1 ;\n",
      "            owl:onProperty dct:temporal ],\n",
      "        [ a owl:Restriction ;\n",
      "            owl:onProperty logset:subject ],\n",
      "        dcat:Distribution .\n",
      "\n",
      "logset:LogSeries a owl:Class ;\n",
      "    rdfs:comment \"\"\" A \"type\" of logfile, eg a console or outage log. Might be\n",
      "                     specific to a type of system, or OS version, but common to\n",
      "                     systems of that type (eg Cray with CNL6). Can be used by\n",
      "                     tools to indicate how to handle a log. Must have a property\n",
      "                     indicating the \"canonical\" format that tools can assume on.\n",
      "                     Note: we may need to add an \"equivalentTo\" property for \n",
      "                     LogSeries that can be in multiple places and formats, eg a\n",
      "                     text log on a server and an index in an ElasticSearch db.\n",
      "                     A LogSeries is expected to be defined in a data dictionary\n",
      "                 \"\"\" ;\n",
      "    rdfs:subClassOf [ a owl:Restriction ;\n",
      "            owl:minCardinality 1 ;\n",
      "            owl:onProperty logset:infoType ],\n",
      "        [ a owl:Restriction ;\n",
      "            owl:cardinality 1 ;\n",
      "            owl:onProperty logset:logFormatType ] .\n",
      "\n",
      "logset:FilenamePattern a owl:Class .\n",
      "\n",
      "logset:LogFormatType a owl:Class ;\n",
      "    rdfs:comment \"\"\" An entity representing how log data is organized, in order \n",
      "                     to help tools decide how to handle a give log.  \n",
      "                     For example, most logs are timestamped-line-per-entry but\n",
      "                     some are a timestamped multiline block, others have a file\n",
      "                     per timestamp and contain a table, others hove no obvious \n",
      "                     structure at all. \n",
      "                     It is likely valuable for a LogFormatType to include a\n",
      "                     dcat:mediaType property, eg \"text/plain\" \n",
      "                     A LogFormatType is expected to be defined in a data \n",
      "                     dictionary and to correspond to a handler class for logs in\n",
      "                     that format\n",
      "                 \"\"\" .\n",
      "\n",
      "\n"
     ]
    }
   ],
   "source": [
    "import sys\n",
    "sys.path.append('/global/homes/s/sleak/.local/cori/3.6-anaconda-4.4/lib/python3.6/site-packages')\n",
    "import rdflib\n",
    "#graph = rdflib.ConjunctiveGraph().parse(vocab_path, format='turtle')\n",
    "gvocab = rdflib.ConjunctiveGraph().parse(vocab_path, format='turtle')\n",
    "\n",
    "# now add the data dictionary:\n",
    "#graph.parse(dict_path, format='turtle')\n",
    "gdict = rdflib.ConjunctiveGraph().parse(dict_path, format='turtle')\n",
    "#gdict = rdflib.ConjunctiveGraph().parse(dict_path)\n",
    "graph = gvocab + gdict\n",
    "\n",
    "print(graph.serialize(format='n3').decode('ascii'))\n",
    "#print(gdict.serialize(format='n3').decode('ascii'))\n",
    "#print(graph.identifier)\n",
    "#print(gvocab.identifier)\n",
    "#print(gdict.identifier)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "@prefix : <http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/dict#> .\n",
      "@prefix cray: <file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/cray-dict#> .\n",
      "@prefix dcat: <http://www.w3.org/ns/dcat#> .\n",
      "@prefix dct: <http://purl.org/dc/terms/> .\n",
      "@prefix default1: <file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#> .\n",
      "@prefix default11: <http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#> .\n",
      "@prefix dict: <http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/dict#> .\n",
      "@prefix logset: <http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#> .\n",
      "@prefix nersc: <file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/nersc#> .\n",
      "@prefix owl: <http://www.w3.org/2002/07/owl#> .\n",
      "@prefix rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .\n",
      "@prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#> .\n",
      "@prefix skos: <http://www.w3.org/2004/02/skos/core#> .\n",
      "@prefix vcard: <http://www.w3.org/2006/vcard/ns#> .\n",
      "@prefix xml: <http://www.w3.org/XML/1998/namespace> .\n",
      "@prefix xsd: <http://www.w3.org/2001/XMLSchema#> .\n",
      "\n",
      "default1: a logset:LogSet ;\n",
      "    rdfs:label \"nersc-logs-001\" ;\n",
      "    logset:subject nersc:cori ;\n",
      "    dct:contactPoint [ a vcard:Individual ;\n",
      "            vcard:email \"sleak@lbl.gov\" ;\n",
      "            vcard:fn \"Steve Leak\" ] ;\n",
      "    dct:description \"a partial sample of cori log data for testing logset tools\" ;\n",
      "    dct:publisher nersc:nersc ;\n",
      "    dct:temporal [ a dct:PeriodOfTime ;\n",
      "            logset:endDate \"2017-09-07T15:22:42.809617-07:00\"^^xsd:dateTime ;\n",
      "            logset:startDate \"2017-09-06T15:18:20.827169-07:00\"^^xsd:dateTime ] ;\n",
      "    dct:title \"Sample NERSC logs\" ;\n",
      "    dcat:distribution default1:console-20170906,\n",
      "        default1:console-20170907,\n",
      "        default1:consumer-20170906,\n",
      "        default1:consumer-20170907,\n",
      "        default1:messages-20170906,\n",
      "        default1:messages-20170907 .\n",
      "\n",
      ":annotationDB a logset:LogSeries ;\n",
      "    logset:logFormat :sqlite3 .\n",
      "\n",
      ":annotations a logset:InfoType .\n",
      "\n",
      ":binaryFile a logset:LogFormatType ;\n",
      "    dcat:mediaType \"application/octet-stream\" .\n",
      "\n",
      ":dateYYYYMMDD a logset:FilenamePattern ;\n",
      "    logset:regex \"(?P<date>(?P<year>20[0-9]{2})(?P<month>0[1-9]|1[0-2])(?P<day>[0-3][0-9]))\" ;\n",
      "    logset:tag \"<date:YYYYMMDD>\" .\n",
      "\n",
      ":filePerTimepoint a logset:LogFormatType ;\n",
      "    dcat:mediaType \"inode/directory\" .\n",
      "\n",
      ":job_records a logset:InfoType .\n",
      "\n",
      ":localCommands a logset:LogFormatType ;\n",
      "    dcat:mediaType \"application/x-executable\" .\n",
      "\n",
      ":log_messages a logset:InfoType .\n",
      "\n",
      ":newtAPI a logset:LogFormatType ;\n",
      "    dcat:mediaType \"application/json\" .\n",
      "\n",
      ":system a logset:FilenamePattern ;\n",
      "    logset:regex \"(?P<system>[a-z][a-z0-9]+)\" ;\n",
      "    logset:tag \"<system:>\" .\n",
      "\n",
      ":timeStampedLogFile a logset:LogFormatType ;\n",
      "    dcat:mediaType \"text/plain\" .\n",
      "\n",
      ":timeYYYYMMDDHHmmss a logset:FilenamePattern ;\n",
      "    logset:regex \"(?P<time>(?P<year>20[0-9]{2})(?P<month>0[1-9]|1[0-2])(?P<day>[0-3][0-9])(?P<hour>[01][0-9]|2[0-3])(?P<minute>[0-5][0-9])(?P<second>[0-5][0-9]))\" ;\n",
      "    logset:tag \"<time:YYYYMMDDHHmmss>\" .\n",
      "\n",
      ":timeYYYYMMDDtHHmmss a logset:FilenamePattern ;\n",
      "    logset:regex \"(?P<time>(?P<year>20[0-9]{2})(?P<month>0[1-9]|1[0-2])(?P<day>[0-3][0-9])t(?P<hour>[01][0-9]|2[0-3])(?P<minute>[0-5][0-9])(?P<second>[0-5][0-9]))\" ;\n",
      "    logset:tag \"<time:YYYYMMDDtHHmmss>\" .\n",
      "\n",
      ":unstructuredTextFile a logset:LogFormatType ;\n",
      "    dcat:mediaType \"text/plain\" .\n",
      "\n",
      "logset: a owl:Ontology ;\n",
      "    rdfs:label \"LogSet\" ;\n",
      "    dct:title \"the LogSet vocabulary\" .\n",
      "\n",
      "logset:affects a owl:ObjectProperty ;\n",
      "    rdfs:comment \"\"\" Components in an HPC center are not a strict hierarchy,\n",
      "                     eg a filesystem might be shared by multiple systems. \n",
      "                     So we connect related systems and subsystems with an \n",
      "                     \"affects\" relationship\n",
      "                 \"\"\" ;\n",
      "    rdfs:domain logset:Subject ;\n",
      "    rdfs:range logset:Subject .\n",
      "\n",
      "logset:endDate a owl:DatatypeProperty ;\n",
      "    rdfs:domain dct:PeriodOfTime ;\n",
      "    rdfs:range xsd:dateTime .\n",
      "\n",
      "logset:estRecordCount a owl:DatatypeProperty ;\n",
      "    rdfs:comment \"\"\" an estimate of the number of records in a ConcreteLog,\n",
      "                     if that is guessable/appropriate\n",
      "                 \"\"\" ;\n",
      "    rdfs:domain logset:ConcreteLog ;\n",
      "    rdfs:range xsd:integer .\n",
      "\n",
      "logset:logFormatInfo a owl:DatatypeProperty ;\n",
      "    rdfs:comment \"\"\" dictionary-like information that a LogFormatType handler \n",
      "                     class can use to interpret a specific type of logfile. Each \n",
      "                     logFormatInfo property should be a literal like \n",
      "                     \"key=value\". Eg, a console_logfile and message_logfile are\n",
      "                     both timeStampedLogFile, but in the console log the \n",
      "                     timestamp is the first \"word\" on each line, while in the \n",
      "                     message log the timestamp is the second word on each line.\n",
      "                     So console_logfile can have recordInfoProperty \"ts_word=0\"\n",
      "                     (and \"part_word=1\" for system component) \n",
      "                 \"\"\" ;\n",
      "    rdfs:domain logset:LogSeries ;\n",
      "    rdfs:range rdfs:Literal .\n",
      "\n",
      "logset:recordCount a owl:DatatypeProperty ;\n",
      "    rdfs:domain logset:ConcreteLog ;\n",
      "    rdfs:range xsd:integer .\n",
      "\n",
      "logset:regex a owl:DatatypeProperty ;\n",
      "    rdfs:domain logset:FilenamePattern ;\n",
      "    rdfs:range rdfs:Literal .\n",
      "\n",
      "logset:specificSubjectPattern a owl:DatatypeProperty ;\n",
      "    rdfs:comment \"\"\" While major system components are represented by a Subject,\n",
      "                     representing specific smaller components (such as compute nodes\n",
      "                     or hsn links) is impractical. To indicate that a log (or LogSet)\n",
      "                     is about eg a specific node, or a subset of links, this literal \n",
      "                     label can be added\n",
      "                 \"\"\" ;\n",
      "    rdfs:domain logset:ConcreteLog ;\n",
      "    rdfs:range rdfs:Literal .\n",
      "\n",
      "logset:startDate a owl:DatatypeProperty ;\n",
      "    rdfs:domain dct:PeriodOfTime ;\n",
      "    rdfs:range xsd:dateTime .\n",
      "\n",
      "logset:tag a owl:DatatypeProperty ;\n",
      "    rdfs:domain logset:FilenamePattern ;\n",
      "    rdfs:range rdfs:Literal .\n",
      "\n",
      "default1:console-20170906 a logset:ConcreteLog ;\n",
      "    logset:isInstanceOf cray:console_logfile ;\n",
      "    dct:temporal [ a dct:PeriodOfTime ;\n",
      "            logset:endDate \"2017-09-06T15:22:42.809617-07:00\"^^xsd:dateTime ;\n",
      "            logset:startDate \"2017-09-06T15:20:21.827169-07:00\"^^xsd:dateTime ] ;\n",
      "    dcat:downloadURL \"p0-20170906t151820/console-20170906\" .\n",
      "\n",
      "default1:console-20170907 a logset:ConcreteLog ;\n",
      "    logset:isInstanceOf cray:console_logfile ;\n",
      "    dct:temporal [ a dct:PeriodOfTime ;\n",
      "            logset:endDate \"2017-09-07T00:01:31.068610-07:00\"^^xsd:dateTime ;\n",
      "            logset:startDate \"2017-09-07T00:00:37.627889-07:00\"^^xsd:dateTime ] ;\n",
      "    dcat:downloadURL \"p0-20170906t151820/console-20170907\" .\n",
      "\n",
      "default1:consumer-20170906 a logset:ConcreteLog ;\n",
      "    logset:isInstanceOf cray:consumer_logfile ;\n",
      "    dct:temporal [ a dct:PeriodOfTime ;\n",
      "            logset:startDate \"2017-09-06T00:00:00\"^^xsd:dateTime ] ;\n",
      "    dcat:downloadURL \"p0-20170906t151820/consumer-20170906\" .\n",
      "\n",
      "default1:consumer-20170907 a logset:ConcreteLog ;\n",
      "    logset:isInstanceOf cray:consumer_logfile ;\n",
      "    dct:temporal [ a dct:PeriodOfTime ;\n",
      "            logset:endDate \"2017-09-07T23:59:59-07:00\"^^xsd:dateTime ;\n",
      "            logset:startDate \"2017-09-07T00:00:00-07:00\"^^xsd:dateTime ] ;\n",
      "    dcat:downloadURL \"p0-20170906t151820/consumer-20170907\" .\n",
      "\n",
      "default1:messages-20170906 a logset:ConcreteLog ;\n",
      "    logset:isInstanceOf cray:messages_logfile ;\n",
      "    logset:subject nersc:cori ;\n",
      "    dct:temporal [ a dct:PeriodOfTime ;\n",
      "            logset:endDate \"2017-09-06T15:29:17.665618-07:00\"^^xsd:dateTime ;\n",
      "            logset:startDate \"2017-09-06T15:26:39.977558-07:00\"^^xsd:dateTime ] ;\n",
      "    dcat:downloadURL \"p0-20170906t151820/messages-20170906\" .\n",
      "\n",
      "default1:messages-20170907 a logset:ConcreteLog ;\n",
      "    logset:isInstanceOf cray:messages_logfile ;\n",
      "    logset:subject nersc:cori ;\n",
      "    dct:temporal [ a dct:PeriodOfTime ;\n",
      "            logset:endDate \"2017-09-07T00:00:01.135482-07:00\"^^xsd:dateTime ;\n",
      "            logset:startDate \"2017-09-07T00:00:01.008501-07:00\"^^xsd:dateTime ] ;\n",
      "    dcat:downloadURL \"p0-20170906t151820/messages-20170907\" .\n",
      "\n",
      ":sqlite3 a logset:LogFormatType ;\n",
      "    dcat:mediaType \"application/x-sqlite3\" .\n",
      "\n",
      "logset:LogSet a owl:Class ;\n",
      "    rdfs:comment \"\"\" A LogSet is a dcat:Dataset of related logs (eg, the logs \n",
      "                     from a Cray boot session on NERSC Cori - related in system\n",
      "                     and access and timespan)\n",
      "                     It is recommended but not enforced that a LogSet instance \n",
      "                     should have certain properties describing its provenance:   \n",
      "                     # dct:title         a rdfs:Literal\n",
      "                     # dct:description   a rdfs:Literal\n",
      "                     # dct:publisher     a foaf:Organization\n",
      "                     # dct:contactPoint  a vcard:Kind\n",
      "                     (publisher and contactPoint are especially useful when the\n",
      "                     actual log data is not directly accessible to people or \n",
      "                     tools using the metadata, so that having identified that \n",
      "                     data exists, they can contact someone to request access).\n",
      "                     The actual files (or db queries etc) of the logs are \n",
      "                     described as a :ConcreteLog, based on dcat:Distribution.\n",
      "                     A LogSet is epected to be defined in its own index file\n",
      "                     and included in a dcat:Catalog\n",
      "                 \"\"\" ;\n",
      "    rdfs:subClassOf dcat:Dataset .\n",
      "\n",
      "logset:infoType a owl:FunctionalProperty,\n",
      "        owl:ObjectProperty ;\n",
      "    rdfs:comment \"\"\" the InfoType for this LogSeries\n",
      "                 \"\"\" ;\n",
      "    rdfs:domain logset:LogSeries ;\n",
      "    rdfs:range logset:InfoType .\n",
      "\n",
      "logset:isInstanceOf a owl:FunctionalProperty,\n",
      "        owl:ObjectProperty ;\n",
      "    rdfs:comment \"Links a LogSeries to log data (eg a log file)\" ;\n",
      "    rdfs:domain logset:ConcreteLog ;\n",
      "    rdfs:range logset:LogSeries .\n",
      "\n",
      "logset:logFormatType a owl:FunctionalProperty,\n",
      "        owl:ObjectProperty ;\n",
      "    rdfs:comment \"\"\" the LogFormatType for this LogSeries\n",
      "                 \"\"\" ;\n",
      "    rdfs:domain logset:LogSeries ;\n",
      "    rdfs:range logset:LogFormatType .\n",
      "\n",
      "logset:subject a owl:ObjectProperty ;\n",
      "    rdfs:comment \"\"\" The Asset whose state this LogSet or ConcreteLog describes.\n",
      "                     (eg a console-log might be for nersc:edison)\n",
      "                 \"\"\" ;\n",
      "    rdfs:domain logset:ConcreteLog ;\n",
      "    rdfs:range logset:Subject .\n",
      "\n",
      "logset:Subject a owl:Class ;\n",
      "    rdfs:comment \"\"\" A thing that a ConcreteLog is about, eg a system or \n",
      "                     subsystem, or even a specific job \n",
      "                 \"\"\" ;\n",
      "    rdfs:subClassOf skos:Concept .\n",
      "\n",
      "logset:InfoType a owl:Class ;\n",
      "    rdfs:comment \"\"\" What the entries in a LogSeries are, eg \"log_messages\"\n",
      "                     or \"job_records\". As an skos:Concept, InfoTypes can be \n",
      "                     linked as skos:narrower/broader/related\n",
      "                 \"\"\" ;\n",
      "    rdfs:subClassOf skos:Concept .\n",
      "\n",
      "logset:LogSeries a owl:Class ;\n",
      "    rdfs:comment \"\"\" A \"type\" of logfile, eg a console or outage log. Might be\n",
      "                     specific to a type of system, or OS version, but common to\n",
      "                     systems of that type (eg Cray with CNL6). Can be used by\n",
      "                     tools to indicate how to handle a log. Must have a property\n",
      "                     indicating the \"canonical\" format that tools can assume on.\n",
      "                     Note: we may need to add an \"equivalentTo\" property for \n",
      "                     LogSeries that can be in multiple places and formats, eg a\n",
      "                     text log on a server and an index in an ElasticSearch db.\n",
      "                     A LogSeries is expected to be defined in a data dictionary\n",
      "                 \"\"\" ;\n",
      "    rdfs:subClassOf [ a owl:Restriction ;\n",
      "            owl:minCardinality 1 ;\n",
      "            owl:onProperty logset:infoType ],\n",
      "        [ a owl:Restriction ;\n",
      "            owl:cardinality 1 ;\n",
      "            owl:onProperty logset:logFormatType ] .\n",
      "\n",
      "logset:FilenamePattern a owl:Class .\n",
      "\n",
      "logset:LogFormatType a owl:Class ;\n",
      "    rdfs:comment \"\"\" An entity representing how log data is organized, in order \n",
      "                     to help tools decide how to handle a give log.  \n",
      "                     For example, most logs are timestamped-line-per-entry but\n",
      "                     some are a timestamped multiline block, others have a file\n",
      "                     per timestamp and contain a table, others hove no obvious \n",
      "                     structure at all. \n",
      "                     It is likely valuable for a LogFormatType to include a\n",
      "                     dcat:mediaType property, eg \"text/plain\" \n",
      "                     A LogFormatType is expected to be defined in a data \n",
      "                     dictionary and to correspond to a handler class for logs in\n",
      "                     that format\n",
      "                 \"\"\" .\n",
      "\n",
      "logset:ConcreteLog a owl:Class ;\n",
      "    rdfs:label \"ConcreteLog\" ;\n",
      "    rdfs:comment \"\"\" An actual, specific log, eg a File or database or web \n",
      "                     service, with knowledge of how to handle this type of \n",
      "                     log in this format. Eg, the actual files in a p0 package\n",
      "                     are ConcreteLog objects.\n",
      "                     Should have either a dcat:downloadURL or a dcat:accessURL.\n",
      "                     May have a logset:subject (assumed from LogSet if not) and\n",
      "                     a logset:specificSubjectLabel\n",
      "                 \"\"\" ;\n",
      "    rdfs:subClassOf [ a owl:Restriction ;\n",
      "            owl:cardinality 1 ;\n",
      "            owl:onProperty logset:isInstanceOf ],\n",
      "        [ a owl:Restriction ;\n",
      "            owl:cardinality 1 ;\n",
      "            owl:onProperty dct:temporal ],\n",
      "        [ a owl:Restriction ;\n",
      "            owl:onProperty logset:subject ],\n",
      "        dcat:Distribution .\n",
      "\n",
      "\n",
      "(rdflib.term.BNode('ub3bL87C18'), rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#startDate'), rdflib.term.Literal('2017-09-07T00:00:00-07:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#messages-20170907'), rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#isInstanceOf'), rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/cray-dict#messages_logfile'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#consumer-20170907'), rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#isInstanceOf'), rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/cray-dict#consumer_logfile'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#'), rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#subject'), rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/nersc#cori'))\n",
      "(rdflib.term.BNode('ub3bL52C18'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://purl.org/dc/terms/PeriodOfTime'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#console-20170907'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#ConcreteLog'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#messages-20170907'), rdflib.term.URIRef('http://purl.org/dc/terms/temporal'), rdflib.term.BNode('ub3bL109C18'))\n",
      "(rdflib.term.BNode('ub3bL52C18'), rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#endDate'), rdflib.term.Literal('2017-09-06T15:22:42.809617-07:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#console-20170906'), rdflib.term.URIRef('http://www.w3.org/ns/dcat#downloadURL'), rdflib.term.Literal('p0-20170906t151820/console-20170906'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#console-20170907'), rdflib.term.URIRef('http://purl.org/dc/terms/temporal'), rdflib.term.BNode('ub3bL65C18'))\n",
      "(rdflib.term.BNode('ub3bL31C18'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://purl.org/dc/terms/PeriodOfTime'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#'), rdflib.term.URIRef('http://purl.org/dc/terms/contactPoint'), rdflib.term.BNode('ub3bL27C22'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#'), rdflib.term.URIRef('http://www.w3.org/ns/dcat#distribution'), rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#consumer-20170907'))\n",
      "(rdflib.term.BNode('ub3bL52C18'), rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#startDate'), rdflib.term.Literal('2017-09-06T15:20:21.827169-07:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#consumer-20170907'), rdflib.term.URIRef('http://purl.org/dc/terms/temporal'), rdflib.term.BNode('ub3bL87C18'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#consumer-20170907'), rdflib.term.URIRef('http://www.w3.org/ns/dcat#downloadURL'), rdflib.term.Literal('p0-20170906t151820/consumer-20170907'))\n",
      "(rdflib.term.BNode('ub3bL98C18'), rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#startDate'), rdflib.term.Literal('2017-09-06T15:26:39.977558-07:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#messages-20170907'), rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#subject'), rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/nersc#cori'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#messages-20170906'), rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#subject'), rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/nersc#cori'))\n",
      "(rdflib.term.BNode('ub3bL65C18'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://purl.org/dc/terms/PeriodOfTime'))\n",
      "(rdflib.term.BNode('ub3bL27C22'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://www.w3.org/2006/vcard/ns#Individual'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#console-20170906'), rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#isInstanceOf'), rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/cray-dict#console_logfile'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#'), rdflib.term.URIRef('http://www.w3.org/ns/dcat#distribution'), rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#messages-20170907'))\n",
      "(rdflib.term.BNode('ub3bL31C18'), rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#endDate'), rdflib.term.Literal('2017-09-07T15:22:42.809617-07:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#messages-20170907'), rdflib.term.URIRef('http://www.w3.org/ns/dcat#downloadURL'), rdflib.term.Literal('p0-20170906t151820/messages-20170907'))\n",
      "(rdflib.term.BNode('ub3bL98C18'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://purl.org/dc/terms/PeriodOfTime'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#messages-20170906'), rdflib.term.URIRef('http://purl.org/dc/terms/temporal'), rdflib.term.BNode('ub3bL98C18'))\n",
      "(rdflib.term.BNode('ub3bL77C18'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://purl.org/dc/terms/PeriodOfTime'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#'), rdflib.term.URIRef('http://www.w3.org/2000/01/rdf-schema#label'), rdflib.term.Literal('nersc-logs-001'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#consumer-20170906'), rdflib.term.URIRef('http://purl.org/dc/terms/temporal'), rdflib.term.BNode('ub3bL77C18'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#LogSet'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#'), rdflib.term.URIRef('http://www.w3.org/ns/dcat#distribution'), rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#console-20170906'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#messages-20170906'), rdflib.term.URIRef('http://www.w3.org/ns/dcat#downloadURL'), rdflib.term.Literal('p0-20170906t151820/messages-20170906'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#messages-20170906'), rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#isInstanceOf'), rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/cray-dict#messages_logfile'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#'), rdflib.term.URIRef('http://www.w3.org/ns/dcat#distribution'), rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#consumer-20170906'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#messages-20170907'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#ConcreteLog'))\n",
      "(rdflib.term.BNode('ub3bL98C18'), rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#endDate'), rdflib.term.Literal('2017-09-06T15:29:17.665618-07:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.BNode('ub3bL27C22'), rdflib.term.URIRef('http://www.w3.org/2006/vcard/ns#email'), rdflib.term.Literal('sleak@lbl.gov'))\n",
      "(rdflib.term.BNode('ub3bL109C18'), rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#startDate'), rdflib.term.Literal('2017-09-07T00:00:01.008501-07:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.BNode('ub3bL87C18'), rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#endDate'), rdflib.term.Literal('2017-09-07T23:59:59-07:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#consumer-20170907'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#ConcreteLog'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#console-20170907'), rdflib.term.URIRef('http://www.w3.org/ns/dcat#downloadURL'), rdflib.term.Literal('p0-20170906t151820/console-20170907'))\n",
      "(rdflib.term.BNode('ub3bL31C18'), rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#startDate'), rdflib.term.Literal('2017-09-06T15:18:20.827169-07:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.BNode('ub3bL87C18'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://purl.org/dc/terms/PeriodOfTime'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#'), rdflib.term.URIRef('http://purl.org/dc/terms/temporal'), rdflib.term.BNode('ub3bL31C18'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#consumer-20170906'), rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#isInstanceOf'), rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/cray-dict#consumer_logfile'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#messages-20170906'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#ConcreteLog'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#consumer-20170906'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#ConcreteLog'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#consumer-20170906'), rdflib.term.URIRef('http://www.w3.org/ns/dcat#downloadURL'), rdflib.term.Literal('p0-20170906t151820/consumer-20170906'))\n",
      "(rdflib.term.BNode('ub3bL65C18'), rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#startDate'), rdflib.term.Literal('2017-09-07T00:00:37.627889-07:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#'), rdflib.term.URIRef('http://purl.org/dc/terms/title'), rdflib.term.Literal('Sample NERSC logs'))\n",
      "(rdflib.term.BNode('ub3bL27C22'), rdflib.term.URIRef('http://www.w3.org/2006/vcard/ns#fn'), rdflib.term.Literal('Steve Leak'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#'), rdflib.term.URIRef('http://www.w3.org/ns/dcat#distribution'), rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#console-20170907'))\n",
      "(rdflib.term.BNode('ub3bL77C18'), rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#startDate'), rdflib.term.Literal('2017-09-06T00:00:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#console-20170906'), rdflib.term.URIRef('http://purl.org/dc/terms/temporal'), rdflib.term.BNode('ub3bL52C18'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#'), rdflib.term.URIRef('http://www.w3.org/ns/dcat#distribution'), rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#messages-20170906'))\n",
      "(rdflib.term.BNode('ub3bL65C18'), rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#endDate'), rdflib.term.Literal('2017-09-07T00:01:31.068610-07:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#'), rdflib.term.URIRef('http://purl.org/dc/terms/description'), rdflib.term.Literal('a partial sample of cori log data for testing logset tools'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#'), rdflib.term.URIRef('http://purl.org/dc/terms/publisher'), rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/nersc#nersc'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#console-20170906'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#ConcreteLog'))\n",
      "(rdflib.term.BNode('ub3bL109C18'), rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#endDate'), rdflib.term.Literal('2017-09-07T00:00:01.135482-07:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.BNode('ub3bL109C18'), rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://purl.org/dc/terms/PeriodOfTime'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#console-20170907'), rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#isInstanceOf'), rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/cray-dict#console_logfile'))\n"
     ]
    }
   ],
   "source": [
    "gindex = rdflib.ConjunctiveGraph().parse('{0:s}/examples/index.ttl'.format(root), format='turtle')\n",
    "#graph.parse('{0:s}/examples/index.ttl'.format(root), format='turtle')\n",
    "graph = (gvocab + gdict) + gindex\n",
    "print(graph.serialize(format='n3').decode('ascii'))\n",
    "#for s,p,o in graph:\n",
    "for s,p,o in gindex:    \n",
    "    print ((s,p,o))\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#'), rdflib.term.Literal('a partial sample of cori log data for testing logset tools'))\n",
      "strings not uris:\n",
      "uris\n",
      "http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/dict#annotationDB\n"
     ]
    }
   ],
   "source": [
    "query = '''SELECT ?id ?desc\n",
    "WHERE {\n",
    "?id a logset:LogSet .\n",
    "?id dct:description ?desc .\n",
    "}'''\n",
    "#print(query[21])\n",
    "for row in graph.query(query):\n",
    "    print(row)\n",
    "\n",
    "    print(\"strings not uris:\")\n",
    "for subject in graph.subjects(rdflib.RDF.type, 'http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#LogSeries'):\n",
    "    print(subject)\n",
    "print(\"uris\")\n",
    "for subject in graph.subjects(rdflib.RDF.type, rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#LogSeries')):\n",
    "    print(subject)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "quering the whole graph:\n",
      "querying only gindex:\n"
     ]
    }
   ],
   "source": [
    "query = '''SELECT ?id ?path\n",
    "WHERE {\n",
    "?id logset:isLogOf dict:console_logfile .\n",
    "?id logset:path ?path .\n",
    "} '''\n",
    "print(\"quering the whole graph:\")\n",
    "for row in graph.query(query):\n",
    "    print(row)\n",
    "    \n",
    "# if I don't explicitly include the logset.ttl in the graph:\n",
    "print(\"querying only gindex:\")\n",
    "# (oh - actually everything needed is in the index.ttl)\n",
    "for row in gindex.query(query):\n",
    "    print(row)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "with full graph:\n",
      "with gindex only:\n"
     ]
    }
   ],
   "source": [
    "query = '''SELECT ?id ?path\n",
    "WHERE {\n",
    "?id a ?type .\n",
    "?type rdfs:subClassOf* logset:ConcreteLog . \n",
    "OPTIONAL { ?id logset:path ?path }\n",
    "} '''\n",
    "query = '''SELECT ?id ?path\n",
    "WHERE {\n",
    "?id a ?type .\n",
    "?type rdfs:subClassOf* dcat:Distribution . \n",
    "OPTIONAL { ?id logset:path ?path }\n",
    "} '''\n",
    "# :ConcreteLog is defined in logset.ttl .. so if our graph includes that (local file) we get:\n",
    "print (\"with full graph:\")\n",
    "for row in graph.query(query):\n",
    "    print(row)\n",
    "    \n",
    "# on the other hand, if we only query the local gindex graph:\n",
    "print (\"with gindex only:\")\n",
    "for row in gindex.query(query):\n",
    "    print(row)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#\n",
      "('xml', rdflib.term.URIRef('http://www.w3.org/XML/1998/namespace'))\n",
      "('rdf', rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#'))\n",
      "('rdfs', rdflib.term.URIRef('http://www.w3.org/2000/01/rdf-schema#'))\n",
      "('xsd', rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#'))\n",
      "('dct', rdflib.term.URIRef('http://purl.org/dc/terms/'))\n",
      "('dcat', rdflib.term.URIRef('http://www.w3.org/ns/dcat#'))\n",
      "('vcard', rdflib.term.URIRef('http://www.w3.org/2006/vcard/ns#'))\n",
      "('logset', rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#'))\n",
      "('dict', rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/dict#'))\n",
      "('cray', rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/cray-dict#'))\n",
      "('nersc', rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/nersc#'))\n",
      "('', rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#'))\n",
      "g now has 63 statements\n",
      "<http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#>\n",
      "http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset\n",
      "g now has 153 statements\n",
      "<http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/dict#>\n",
      "http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/dict\n",
      "g now has 184 statements\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#consumer-20170907'), None)\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#console-20170907'), None)\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#messages-20170907'), None)\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#messages-20170906'), None)\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#consumer-20170906'), None)\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#console-20170906'), None)\n",
      "logseries:\n",
      "http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/dict#annotationDB\n"
     ]
    }
   ],
   "source": [
    "# so to assemble the full graph, I need to explicitly parse the vocab and data dictionary:\n",
    "# (mostly useful for catalog, as it will find subgraphs from there)\n",
    "\n",
    "# can i parse a remote graph at all?\n",
    "#g1 = rdflib.Graph().parse('https://www.w3.org/ns/dcat.ttl')\n",
    "#print (g1)\n",
    "# yes! but providing a format might be necessary\n",
    "#gg = rdflib.Graph().parse('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/logset.ttl', format='turtle')\n",
    "gindex = rdflib.ConjunctiveGraph().parse('{0:s}/examples/index.ttl'.format(root), format='turtle')\n",
    "##for s,p,o in gindex:    \n",
    "##    print ((s,p,o))\n",
    "namespaces=dict([n for n in gindex.namespaces()])\n",
    "print(namespaces['logset'])\n",
    "for n in gindex.namespaces():\n",
    "    print (n)\n",
    "#print(dir(rdflib.term.URIRef))\n",
    "#print(rdflib.term.URIRef.__class__)\n",
    "g = gindex\n",
    "print (\"g now has {0} statements\".format(len(g)))\n",
    "for uri in [n[1] for n in gindex.namespaces() if n[0] in ('logset','dict')]:\n",
    "    print(str(uri.n3()))\n",
    "    print(str(uri)[:-1])\n",
    "    gsource=str(uri)[:-1] + '.ttl'   # needs extension or 404!\n",
    "    g += rdflib.ConjunctiveGraph().parse(gsource, format='turtle')\n",
    "    print (\"g now has {0} statements\".format(len(g)))\n",
    "    #summary = g.serialize(format='n3').decode('ascii')\n",
    "    #print(summary.splitlines()[:10])\n",
    "    #print(g.serialize(format='n3').decode('ascii'))\n",
    "\n",
    "# now what if I run that same query:\n",
    "query = '''SELECT ?id ?path\n",
    "WHERE {\n",
    "?id a ?type .\n",
    "?type rdfs:subClassOf* dcat:Distribution . \n",
    "OPTIONAL { ?id logset:path ?path }\n",
    "} '''\n",
    "for row in g.query(query):\n",
    "    print(row)\n",
    "    \n",
    "print(\"logseries:\")\n",
    "for subject in graph.subjects(rdflib.RDF.type, rdflib.term.URIRef('http://portal.nersc.gov/project/mpccc/sleak/resilience/datasets/logset#LogSeries')):\n",
    "    print(subject)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#console-20170907'), rdflib.term.Literal('p0-20170906t151820/console-20170907'), rdflib.term.BNode('ub4bL63C18'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#console-20170906'), rdflib.term.Literal('p0-20170906t151820/console-20170906'), rdflib.term.BNode('ub4bL52C18'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#messages-20170907'), rdflib.term.Literal('p0-20170906t151820/messages-20170907'), rdflib.term.BNode('ub4bL107C18'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#consumer-20170906'), rdflib.term.Literal('p0-20170906t151820/consumer-20170906'), rdflib.term.BNode('ub4bL75C18'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#messages-20170906'), rdflib.term.Literal('p0-20170906t151820/messages-20170906'), rdflib.term.BNode('ub4bL96C18'))\n",
      "(rdflib.term.URIRef('file:///global/u1/s/sleak/Monitoring/Resilience/LogSet/examples/index#consumer-20170907'), rdflib.term.Literal('p0-20170906t151820/consumer-20170907'), rdflib.term.BNode('ub4bL85C18'))\n"
     ]
    }
   ],
   "source": [
    "query = '''SELECT ?id ?path\n",
    "WHERE {\n",
    "?id logset:isLogOf dict:console_logfile .\n",
    "?id logset:path ?path .\n",
    "} '''\n",
    "# now we can find the datasources in the loaded graph\n",
    "query2 = '''SELECT ?id ?path ?time\n",
    "WHERE {\n",
    "?id a ?type .\n",
    "?type rdfs:subClassOf* logset:ConcreteLog . \n",
    "?id dct:temporal ?time .\n",
    "OPTIONAL { ?id dcat:downloadURL ?path }\n",
    "} '''\n",
    "#query3 = '''SELECT ?id ?type ?base\n",
    "#WHERE {\n",
    "#?id a ?type .\n",
    "#OPTIONAL { ?type rdfs:subClassOf ?base }\n",
    "#}'''\n",
    "for row in g.query(query2):\n",
    "    print(row)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = '''SELECT ?id ?path\n",
    "WHERE {\n",
    "?id logset:isInstanceOf [ dict:console_logfile . \n",
    "?id dcat:downloadURL ?path .\n",
    "} '''\n",
    "query = '''SELECT ?id\n",
    "WHERE {\n",
    "?id a logset:LogSeries .\n",
    "}\n",
    "'''\n",
    "query = '''SELECT ?id ?path\n",
    "WHERE {\n",
    "?id logset:isInstanceOf [a logset:LogSeries] .\n",
    "?id dcat:downloadURL ?path .\n",
    "}\n",
    "'''\n",
    "for row in g.query(query):\n",
    "    print(row)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/dict#consumer_logfile'), rdflib.term.Literal('filepattern=consumer'))\n",
      "(rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/dict#consumer_logfile'), rdflib.term.Literal('filepattern=consumer-<dateYYYYMMDD>'))\n",
      "(rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/dict#messages_logfile'), rdflib.term.Literal('filepattern=messages'))\n",
      "(rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/dict#messages_logfile'), rdflib.term.Literal('ts_word=1'))\n",
      "(rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/dict#messages_logfile'), rdflib.term.Literal('filepattern=messages-<dateYYYYMMDD>'))\n",
      "(rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/dict#messages_logfile'), rdflib.term.Literal('part_word=2'))\n",
      "(rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/dict#console_logfile'), rdflib.term.Literal('filepattern=console'))\n",
      "(rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/dict#console_logfile'), rdflib.term.Literal('part_word=1'))\n",
      "(rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/dict#console_logfile'), rdflib.term.Literal('ts_word=0'))\n",
      "(rdflib.term.URIRef('https://raw.githubusercontent.com/NERSC/LogSet/master/etc/dict#console_logfile'), rdflib.term.Literal('filepattern=console-<dateYYYYMMDD>'))\n"
     ]
    }
   ],
   "source": [
    "query = '''SELECT ?series ?filepattern\n",
    "WHERE {\n",
    "?series a logset:LogSeries .\n",
    "?series logset:logFormatInfo ?filepattern .\n",
    "}\n",
    "'''\n",
    "for row in g.query(query):\n",
    "    print(row)\n",
    "# it seems graphs don't do regex filtering of literals well, so best is \n",
    "# to collect the logFormatInfos for each series, build a dictionary of \n",
    "# lists-of-values, and work with that"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(rdflib.term.BNode('f1454b393d3b34d8fbf97b594baecf658b5'), rdflib.term.Literal('p0-20170906t151820/consumer-20170907'), rdflib.term.Literal('2017-09-07T00:00:00-07:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.BNode('f1454b393d3b34d8fbf97b594baecf658b7'), rdflib.term.Literal('p0-20170906t151820/messages-20170907'), rdflib.term.Literal('2017-09-07T00:00:01.008501-07:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n",
      "(rdflib.term.BNode('f1454b393d3b34d8fbf97b594baecf658b3'), rdflib.term.Literal('p0-20170906t151820/console-20170907'), rdflib.term.Literal('2017-09-07T00:00:37.627889-07:00', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#dateTime')))\n"
     ]
    }
   ],
   "source": [
    "# next: querying on datetime fields:\n",
    "query = '''SELECT ?id ?path ?start\n",
    "WHERE {\n",
    "?id logset:isInstanceOf [a logset:LogSeries] .\n",
    "?id dcat:downloadURL ?path .\n",
    "?id dct:temporal/logset:startDate ?start .\n",
    "FILTER (?start >= \"2017-09-07-07:00\"^^xsd:dateTime)\n",
    "}\n",
    "'''\n",
    "# FILTER (?time = \"2017-09-07\"^^xsd:dateTime)\n",
    "# this doesn't work:\n",
    "# ?id dct:temporal [a dct:PeriodOfTime ; logset:startDate ?start ; OPTIONAL { logset:endDate ?end } ] .\n",
    "for row in g.query(query):\n",
    "    print(row)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "ename": "NameError",
     "evalue": "name '__version__' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mNameError\u001b[0m                                 Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-12-d0ad0054b387>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m()\u001b[0m\n\u001b[0;32m----> 1\u001b[0;31m \u001b[0m__version__\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m",
      "\u001b[0;31mNameError\u001b[0m: name '__version__' is not defined"
     ]
    }
   ],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python [default]",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
